notebook/rlx-doc.org
** *ACTIVE-WIDGETS*
*** Documentation
List of active widget objects. 
These widgets receive input events and are rendered to the screen by
the console. See also `send-event-to-widgets'.

Do not set this variable directly from a module; instead, call
`install-widgets'.
** *BROWSER*
** *CHOOSE-DIRECTION-MENU*
** *COLORS*
** *COMPASS-DIRECTIONS*
*** Documentation
List of keywords representing the eight compass directions, plus :here.
** *COMPASS-OPPOSITES*
*** Documentation
Property list mapping direction keywords to their 180-degree
opposites.
** *DEFAULT-ACTION-POINTS*
** *DEFAULT-FONT*
** *DEFAULT-FRAME-HEIGHT*
** *DEFAULT-FRAME-WIDTH*
** *DEFAULT-MESSAGE-VERBOSITIES*
** *DEFAULT-WORLD-AXIS-SIZE*
** *DEFAULT-WORLD-Z-SIZE*
** *EVENT-HANDLER-FUNCTION*
*** Documentation
Function to be called with keypress events. This function should
accept an event list of the form

  (STRING . MODIFIERS)

where STRING is a string representing the key, and MODIFIERS is a list
of key modifier symbols like :shift, :control, :alt, and so on.

The modifier list is sorted; thus, events can be compared for
equality with `equal' and used as hashtable keys.

The default event handler is `send-event-to-widgets', which see. An
XE2 game can use the widget framework to do its drawing and event
handling, or override `*event-handler-function*' and do something
else.
** *FRAME-RATE*
** *FULLSCREEN*
** *GENERIC-JOYSTICK-MAPPING*
** *GRAMMAR*
*** Documentation
The current context-free grammar used for sentence generation.
This is an association list of the form:

    ((VARIABLE >> EXPANSIONS)
     (VARIABLE >> EXPANSIONS)
     ...)

Where EXPANSIONS is a list of alternatives, each of which may be
either (1) single symbols or (2) a list of symbols, representing
concatenation.
** *INITIALIZATION-HOOK*
** *JOYSTICK-MAPPING*
** *MESSAGE-LOGGING*
** *MESSAGE-SEND-SYMBOL-SUFFIX*
** *MESSAGE-SENDER*
** *MESSAGE-VERBOSITIES*
*** Documentation
Property list mapping message keywords to the integers from 1-3.
A message outputs if its verbosity level is less than or equal to the
narration window's verbosity level. Level 1 is normal gameplay output,
while levels 2 and 3 offer increading debug information. Values of nil
and t mean to never (and always, respectively) output, regardless of
verbosity level.
** *MODULE-DIRECTORIES*
** *MODULE-WIDGETS*
*** Documentation
List of widget objects in the current module.
** *NEXT-MODULE*
** *PS3-JOYSTICK-MAPPING*
** *QUITTING*
** *RESOURCE-HANDLERS*
*** Documentation
A property list mapping resource type keywords to handler functions.
Each function should accept one resource record, and return an
object (possibly driver-dependent). When a resource is loaded (with
`load-resource'), the appropriate handler is looked up, and invoked on
the resource record.  The return value is stored in the OBJECT field
of the record.
** *RESOURCE-TABLE*
*** Documentation
A hash table mapping resource names to resource records. All loaded
resources go in this one hash table.
** *SCREEN-HEIGHT*
*** Documentation
The height (in pixels) of the game
window. Set this in the game startup file.
** *SCREEN-WIDTH*
*** Documentation
The width (in pixels) of the game
window. Set this in the game startup file.
** *SENDER*
*** Documentation
This variable is bound to the object (if any) to
receive sent messages.
** *STANDARD-CATEGORIES*
** *STARTUP*
** *TIMER-INTERVAL*
*** Documentation
Number of frames to wait before sending each timer event.
** *UNIVERSE*
** *USE-SOUND*
** *USER-INIT-FILE-NAME*
** *USER-KEYBOARD-LAYOUT*
** *WINDOW-TITLE*
** *WORLD*
