notebook/rlx-doc.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>rlx-doc</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 18:58:41 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">rlx-doc</h1>


<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><b>ACTIVE-WIDGETS</b> </h3>
<div class="outline-text-3" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1">Documentation </h4>
<div class="outline-text-4" id="text-1-1">

<p>List of active widget objects. 
These widgets receive input events and are rendered to the screen by
the console. See also `send-event-to-widgets'.
</p>
<p>
Do not set this variable directly from a module; instead, call
`install-widgets'.
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2"><b>BROWSER</b> </h3>
<div class="outline-text-3" id="text-2">

</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3"><b>CHOOSE-DIRECTION-MENU</b> </h3>
<div class="outline-text-3" id="text-3">

</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4"><b>COLORS</b> </h3>
<div class="outline-text-3" id="text-4">

</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5"><b>COMPASS-DIRECTIONS</b> </h3>
<div class="outline-text-3" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-4">
<h4 id="sec-5-1">Documentation </h4>
<div class="outline-text-4" id="text-5-1">

<p>List of keywords representing the eight compass directions, plus :here.
</p></div>
</div>

</div>

<div id="outline-container-6" class="outline-3">
<h3 id="sec-6"><b>COMPASS-OPPOSITES</b> </h3>
<div class="outline-text-3" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-4">
<h4 id="sec-6-1">Documentation </h4>
<div class="outline-text-4" id="text-6-1">

<p>Property list mapping direction keywords to their 180-degree
opposites.
</p></div>
</div>

</div>

<div id="outline-container-7" class="outline-3">
<h3 id="sec-7"><b>DEFAULT-ACTION-POINTS</b> </h3>
<div class="outline-text-3" id="text-7">

</div>

</div>

<div id="outline-container-8" class="outline-3">
<h3 id="sec-8"><b>DEFAULT-FONT</b> </h3>
<div class="outline-text-3" id="text-8">

</div>

</div>

<div id="outline-container-9" class="outline-3">
<h3 id="sec-9"><b>DEFAULT-FRAME-HEIGHT</b> </h3>
<div class="outline-text-3" id="text-9">

</div>

</div>

<div id="outline-container-10" class="outline-3">
<h3 id="sec-10"><b>DEFAULT-FRAME-WIDTH</b> </h3>
<div class="outline-text-3" id="text-10">

</div>

</div>

<div id="outline-container-11" class="outline-3">
<h3 id="sec-11"><b>DEFAULT-MESSAGE-VERBOSITIES</b> </h3>
<div class="outline-text-3" id="text-11">

</div>

</div>

<div id="outline-container-12" class="outline-3">
<h3 id="sec-12"><b>DEFAULT-WORLD-AXIS-SIZE</b> </h3>
<div class="outline-text-3" id="text-12">

</div>

</div>

<div id="outline-container-13" class="outline-3">
<h3 id="sec-13"><b>DEFAULT-WORLD-Z-SIZE</b> </h3>
<div class="outline-text-3" id="text-13">

</div>

</div>

<div id="outline-container-14" class="outline-3">
<h3 id="sec-14"><b>EVENT-HANDLER-FUNCTION</b> </h3>
<div class="outline-text-3" id="text-14">


</div>

<div id="outline-container-14-1" class="outline-4">
<h4 id="sec-14-1">Documentation </h4>
<div class="outline-text-4" id="text-14-1">

<p>Function to be called with keypress events. This function should
accept an event list of the form
</p>
<p>
  (STRING . MODIFIERS)
</p>
<p>
where STRING is a string representing the key, and MODIFIERS is a list
of key modifier symbols like :shift, :control, :alt, and so on.
</p>
<p>
The modifier list is sorted; thus, events can be compared for
equality with `equal' and used as hashtable keys.
</p>
<p>
The default event handler is `send-event-to-widgets', which see. An
XE2 game can use the widget framework to do its drawing and event
handling, or override `*event-handler-function*' and do something
else.
</p></div>
</div>

</div>

<div id="outline-container-15" class="outline-3">
<h3 id="sec-15"><b>FRAME-RATE</b> </h3>
<div class="outline-text-3" id="text-15">

</div>

</div>

<div id="outline-container-16" class="outline-3">
<h3 id="sec-16"><b>FULLSCREEN</b> </h3>
<div class="outline-text-3" id="text-16">

</div>

</div>

<div id="outline-container-17" class="outline-3">
<h3 id="sec-17"><b>GENERIC-JOYSTICK-MAPPING</b> </h3>
<div class="outline-text-3" id="text-17">

</div>

</div>

<div id="outline-container-18" class="outline-3">
<h3 id="sec-18"><b>GRAMMAR</b> </h3>
<div class="outline-text-3" id="text-18">


</div>

<div id="outline-container-18-1" class="outline-4">
<h4 id="sec-18-1">Documentation </h4>
<div class="outline-text-4" id="text-18-1">

<p>The current context-free grammar used for sentence generation.
This is an association list of the form:
</p>
<p>
    ((VARIABLE &gt;&gt; EXPANSIONS)
     (VARIABLE &gt;&gt; EXPANSIONS)
     &hellip;)
</p>
<p>
Where EXPANSIONS is a list of alternatives, each of which may be
either (1) single symbols or (2) a list of symbols, representing
concatenation.
</p></div>
</div>

</div>

<div id="outline-container-19" class="outline-3">
<h3 id="sec-19"><b>INITIALIZATION-HOOK</b> </h3>
<div class="outline-text-3" id="text-19">

</div>

</div>

<div id="outline-container-20" class="outline-3">
<h3 id="sec-20"><b>JOYSTICK-MAPPING</b> </h3>
<div class="outline-text-3" id="text-20">

</div>

</div>

<div id="outline-container-21" class="outline-3">
<h3 id="sec-21"><b>MESSAGE-LOGGING</b> </h3>
<div class="outline-text-3" id="text-21">

</div>

</div>

<div id="outline-container-22" class="outline-3">
<h3 id="sec-22"><b>MESSAGE-SEND-SYMBOL-SUFFIX</b> </h3>
<div class="outline-text-3" id="text-22">

</div>

</div>

<div id="outline-container-23" class="outline-3">
<h3 id="sec-23"><b>MESSAGE-SENDER</b> </h3>
<div class="outline-text-3" id="text-23">

</div>

</div>

<div id="outline-container-24" class="outline-3">
<h3 id="sec-24"><b>MESSAGE-VERBOSITIES</b> </h3>
<div class="outline-text-3" id="text-24">


</div>

<div id="outline-container-24-1" class="outline-4">
<h4 id="sec-24-1">Documentation </h4>
<div class="outline-text-4" id="text-24-1">

<p>Property list mapping message keywords to the integers from 1-3.
A message outputs if its verbosity level is less than or equal to the
narration window's verbosity level. Level 1 is normal gameplay output,
while levels 2 and 3 offer increading debug information. Values of nil
and t mean to never (and always, respectively) output, regardless of
verbosity level.
</p></div>
</div>

</div>

<div id="outline-container-25" class="outline-3">
<h3 id="sec-25"><b>MODULE-DIRECTORIES</b> </h3>
<div class="outline-text-3" id="text-25">

</div>

</div>

<div id="outline-container-26" class="outline-3">
<h3 id="sec-26"><b>MODULE-WIDGETS</b> </h3>
<div class="outline-text-3" id="text-26">


</div>

<div id="outline-container-26-1" class="outline-4">
<h4 id="sec-26-1">Documentation </h4>
<div class="outline-text-4" id="text-26-1">

<p>List of widget objects in the current module.
</p></div>
</div>

</div>

<div id="outline-container-27" class="outline-3">
<h3 id="sec-27"><b>NEXT-MODULE</b> </h3>
<div class="outline-text-3" id="text-27">

</div>

</div>

<div id="outline-container-28" class="outline-3">
<h3 id="sec-28"><b>PS3-JOYSTICK-MAPPING</b> </h3>
<div class="outline-text-3" id="text-28">

</div>

</div>

<div id="outline-container-29" class="outline-3">
<h3 id="sec-29"><b>QUITTING</b> </h3>
<div class="outline-text-3" id="text-29">

</div>

</div>

<div id="outline-container-30" class="outline-3">
<h3 id="sec-30"><b>RESOURCE-HANDLERS</b> </h3>
<div class="outline-text-3" id="text-30">


</div>

<div id="outline-container-30-1" class="outline-4">
<h4 id="sec-30-1">Documentation </h4>
<div class="outline-text-4" id="text-30-1">

<p>A property list mapping resource type keywords to handler functions.
Each function should accept one resource record, and return an
object (possibly driver-dependent). When a resource is loaded (with
`load-resource'), the appropriate handler is looked up, and invoked on
the resource record.  The return value is stored in the OBJECT field
of the record.
</p></div>
</div>

</div>

<div id="outline-container-31" class="outline-3">
<h3 id="sec-31"><b>RESOURCE-TABLE</b> </h3>
<div class="outline-text-3" id="text-31">


</div>

<div id="outline-container-31-1" class="outline-4">
<h4 id="sec-31-1">Documentation </h4>
<div class="outline-text-4" id="text-31-1">

<p>A hash table mapping resource names to resource records. All loaded
resources go in this one hash table.
</p></div>
</div>

</div>

<div id="outline-container-32" class="outline-3">
<h3 id="sec-32"><b>SCREEN-HEIGHT</b> </h3>
<div class="outline-text-3" id="text-32">


</div>

<div id="outline-container-32-1" class="outline-4">
<h4 id="sec-32-1">Documentation </h4>
<div class="outline-text-4" id="text-32-1">

<p>The height (in pixels) of the game
window. Set this in the game startup file.
</p></div>
</div>

</div>

<div id="outline-container-33" class="outline-3">
<h3 id="sec-33"><b>SCREEN-WIDTH</b> </h3>
<div class="outline-text-3" id="text-33">


</div>

<div id="outline-container-33-1" class="outline-4">
<h4 id="sec-33-1">Documentation </h4>
<div class="outline-text-4" id="text-33-1">

<p>The width (in pixels) of the game
window. Set this in the game startup file.
</p></div>
</div>

</div>

<div id="outline-container-34" class="outline-3">
<h3 id="sec-34"><b>SENDER</b> </h3>
<div class="outline-text-3" id="text-34">


</div>

<div id="outline-container-34-1" class="outline-4">
<h4 id="sec-34-1">Documentation </h4>
<div class="outline-text-4" id="text-34-1">

<p>This variable is bound to the object (if any) to
receive sent messages.
</p></div>
</div>

</div>

<div id="outline-container-35" class="outline-3">
<h3 id="sec-35"><b>STANDARD-CATEGORIES</b> </h3>
<div class="outline-text-3" id="text-35">

</div>

</div>

<div id="outline-container-36" class="outline-3">
<h3 id="sec-36"><b>STARTUP</b> </h3>
<div class="outline-text-3" id="text-36">

</div>

</div>

<div id="outline-container-37" class="outline-3">
<h3 id="sec-37"><b>TIMER-INTERVAL</b> </h3>
<div class="outline-text-3" id="text-37">


</div>

<div id="outline-container-37-1" class="outline-4">
<h4 id="sec-37-1">Documentation </h4>
<div class="outline-text-4" id="text-37-1">

<p>Number of frames to wait before sending each timer event.
</p></div>
</div>

</div>

<div id="outline-container-38" class="outline-3">
<h3 id="sec-38"><b>UNIVERSE</b> </h3>
<div class="outline-text-3" id="text-38">

</div>

</div>

<div id="outline-container-39" class="outline-3">
<h3 id="sec-39"><b>USE-SOUND</b> </h3>
<div class="outline-text-3" id="text-39">

</div>

</div>

<div id="outline-container-40" class="outline-3">
<h3 id="sec-40"><b>USER-INIT-FILE-NAME</b> </h3>
<div class="outline-text-3" id="text-40">

</div>

</div>

<div id="outline-container-41" class="outline-3">
<h3 id="sec-41"><b>USER-KEYBOARD-LAYOUT</b> </h3>
<div class="outline-text-3" id="text-41">

</div>

</div>
