notebook/rlx-doc.org
*** Documentation
The current world object. Only one may be active at a time. See also
worlds.lisp. Cells are free to send messages to `*world*' at
any time, because it is always bound to the world containing the cell
at the time the cell method is run.
** *X11-COLOR-DATA*
** *ZOOM-FACTOR*
** =ASTERISK=
** =BROWSER=
** =CELL=
** =DIRECTION-CHOOSER=
** =ENVIRONMENT=
** =EQUIPMENT=
** =FORMATTER=
** =GATEWAY=
** =GRAY-ASTERISK=
** =INVENTORY=
** =LAUNCHPAD=
** =MENU-ITEM=
** =MINIMAP=
** =MISSION=
** =NARRATOR=
** =PAGER-PROMPT=
** =PAGER=
** =PROMPT=
** =SPRITE=
** =STACK=
** =TEXTBOX=
** =UNIVERSE=
** =VIEWPORT=
** =WIDGET=
** =WORLD=
** ADD-HOOK
*** Arguments
(HOOK FUNC)
*** Documentation
Arrange for FUNC to be invoked whenever HOOK is triggered with
`run-hook'. The function should have no arguments.
** ADD-MESSAGE-VERBOSITIES
*** Arguments
(PLIST)
** ADD-OVERLAY
** BIND-KEY-TO-METHOD
*** Arguments
(P KEY MODIFIERS METHOD-KEYWORD)
** BIND-KEY-TO-PROMPT-INSERTION
*** Arguments
(P KEY MODIFIERS &OPTIONAL (INSERTION KEY))
** BROWSER
** CLONE
*** Arguments
(PROTOTYPE &REST INITARGS)
*** Documentation
Create a new object from PROTOTYPE and pass INITARGS to the
initializer. The new object is created with fields for which INITFORMS
were specified (if any; see `define-prototype'); the INITFORMS are
evaluated, then any applicable initializer is triggered.
** COMPOSE-BLANK-FIELDS
*** Arguments
(DESCRIPTORS)
** CREATE-IMAGE
*** Arguments
(WIDTH HEIGHT)
*** Documentation
Create a new XE2 image of size (* WIDTH HEIGHT).
** DEFCELL
*** Arguments
(&REST ARGS)
** DEFINE-METHOD
*** Arguments
(&REST ARGS)
*** Documentation
Define a new method.

METHOD-NAME is a symbol naming the method.  PROTOTYPE-NAME is the name
of the prototype you are defining a method for. This should be a
symbol (without equals signs---see Prototype Names. ARGLIST is
the argument list for the method. If METHOD-BODY begins with a string,
this string becomes the documentation string for the method.

Any DECLARE forms must appear as the first non-string sexp.

The forms in METHOD-BODY are executed when the method is invoked.
The hidden argument `self' may be referred to as needed within
the method body; it is bound to the object upon which the method
was invoked.
** DEFINE-PROTOTYPE
*** Arguments
(&REST ARGS)
*** Documentation
Create a new object prototype (possibly based on another prototype).

NAME should be a symbol naming the prototype. A special variable is
created, with equals signs bracketing the name; this variable's value
is the resulting prototype. For example, if your prototype is named
`foo', the special variable will be named `=foo=', and you create
objects with:

 (clone =foo=)

See also `clone'. 

The second argument is a property list of options for the
prototype. Valid keys are:

 :DOCUMENTATION     The documentation string for this prototype.
 :PARENT            The parent prototype from which the new prototype will 
                    inherit fields. This form is evaluated.
                     
DECLARATION-FIELD-DESCRIPTORS should be a list, each entry of which is
either a list of the form

  (FIELD-NAME . OPTIONS)

or, simply a symbol naming the field---a shorthand for declaring a
field with that name and no options. See also
`transform-declaration-field-descriptor'.

OPTIONS is a property list of field options. Valid keys are:

 :INITFORM          A form evaluated to initialize the field
                    upon cloning. If :initform is not provided,
                    the value is inherited from the PARENT.
                    With ":initform nil", the field is initialized 
                    with the value nil.
 :DOCUMENTATION     Documentation string for the field.
** DEFSPRITE
*** Arguments
(&REST ARGS)
** DIRECTION-TO
*** Arguments
(R1 C1 R2 C2)
