notebook/rlx-doc.html

<div id="outline-container-42" class="outline-3">
<h3 id="sec-42"><b>WINDOW-TITLE</b> </h3>
<div class="outline-text-3" id="text-42">

</div>

</div>

<div id="outline-container-43" class="outline-3">
<h3 id="sec-43"><b>WORLD</b> </h3>
<div class="outline-text-3" id="text-43">


</div>

<div id="outline-container-43-1" class="outline-4">
<h4 id="sec-43-1">Documentation </h4>
<div class="outline-text-4" id="text-43-1">

<p>The current world object. Only one may be active at a time. See also
worlds.lisp. Cells are free to send messages to `*world*' at
any time, because it is always bound to the world containing the cell
at the time the cell method is run.
</p></div>
</div>

</div>

<div id="outline-container-44" class="outline-3">
<h3 id="sec-44"><b>X11-COLOR-DATA</b> </h3>
<div class="outline-text-3" id="text-44">

</div>

</div>

<div id="outline-container-45" class="outline-3">
<h3 id="sec-45"><b>ZOOM-FACTOR</b> </h3>
<div class="outline-text-3" id="text-45">

</div>

</div>

<div id="outline-container-46" class="outline-3">
<h3 id="sec-46"><code>ASTERISK</code> </h3>
<div class="outline-text-3" id="text-46">

</div>

</div>

<div id="outline-container-47" class="outline-3">
<h3 id="sec-47"><code>BROWSER</code> </h3>
<div class="outline-text-3" id="text-47">

</div>

</div>

<div id="outline-container-48" class="outline-3">
<h3 id="sec-48"><code>CELL</code> </h3>
<div class="outline-text-3" id="text-48">

</div>

</div>

<div id="outline-container-49" class="outline-3">
<h3 id="sec-49"><code>DIRECTION-CHOOSER</code> </h3>
<div class="outline-text-3" id="text-49">

</div>

</div>

<div id="outline-container-50" class="outline-3">
<h3 id="sec-50"><code>ENVIRONMENT</code> </h3>
<div class="outline-text-3" id="text-50">

</div>

</div>

<div id="outline-container-51" class="outline-3">
<h3 id="sec-51"><code>EQUIPMENT</code> </h3>
<div class="outline-text-3" id="text-51">

</div>

</div>

<div id="outline-container-52" class="outline-3">
<h3 id="sec-52"><code>FORMATTER</code> </h3>
<div class="outline-text-3" id="text-52">

</div>

</div>

<div id="outline-container-53" class="outline-3">
<h3 id="sec-53"><code>GATEWAY</code> </h3>
<div class="outline-text-3" id="text-53">

</div>

</div>

<div id="outline-container-54" class="outline-3">
<h3 id="sec-54"><code>GRAY-ASTERISK</code> </h3>
<div class="outline-text-3" id="text-54">

</div>

</div>

<div id="outline-container-55" class="outline-3">
<h3 id="sec-55"><code>INVENTORY</code> </h3>
<div class="outline-text-3" id="text-55">

</div>

</div>

<div id="outline-container-56" class="outline-3">
<h3 id="sec-56"><code>LAUNCHPAD</code> </h3>
<div class="outline-text-3" id="text-56">

</div>

</div>

<div id="outline-container-57" class="outline-3">
<h3 id="sec-57"><code>MENU-ITEM</code> </h3>
<div class="outline-text-3" id="text-57">

</div>

</div>

<div id="outline-container-58" class="outline-3">
<h3 id="sec-58"><code>MINIMAP</code> </h3>
<div class="outline-text-3" id="text-58">

</div>

</div>

<div id="outline-container-59" class="outline-3">
<h3 id="sec-59"><code>MISSION</code> </h3>
<div class="outline-text-3" id="text-59">

</div>

</div>

<div id="outline-container-60" class="outline-3">
<h3 id="sec-60"><code>NARRATOR</code> </h3>
<div class="outline-text-3" id="text-60">

</div>

</div>

<div id="outline-container-61" class="outline-3">
<h3 id="sec-61"><code>PAGER-PROMPT</code> </h3>
<div class="outline-text-3" id="text-61">

</div>

</div>

<div id="outline-container-62" class="outline-3">
<h3 id="sec-62"><code>PAGER</code> </h3>
<div class="outline-text-3" id="text-62">

</div>

</div>

<div id="outline-container-63" class="outline-3">
<h3 id="sec-63"><code>PROMPT</code> </h3>
<div class="outline-text-3" id="text-63">

</div>

</div>

<div id="outline-container-64" class="outline-3">
<h3 id="sec-64"><code>SPRITE</code> </h3>
<div class="outline-text-3" id="text-64">

</div>

</div>

<div id="outline-container-65" class="outline-3">
<h3 id="sec-65"><code>STACK</code> </h3>
<div class="outline-text-3" id="text-65">

</div>

</div>

<div id="outline-container-66" class="outline-3">
<h3 id="sec-66"><code>TEXTBOX</code> </h3>
<div class="outline-text-3" id="text-66">

</div>

</div>

<div id="outline-container-67" class="outline-3">
<h3 id="sec-67"><code>UNIVERSE</code> </h3>
<div class="outline-text-3" id="text-67">

</div>

</div>

<div id="outline-container-68" class="outline-3">
<h3 id="sec-68"><code>VIEWPORT</code> </h3>
<div class="outline-text-3" id="text-68">

</div>

</div>

<div id="outline-container-69" class="outline-3">
<h3 id="sec-69"><code>WIDGET</code> </h3>
<div class="outline-text-3" id="text-69">

</div>

</div>

<div id="outline-container-70" class="outline-3">
<h3 id="sec-70"><code>WORLD</code> </h3>
<div class="outline-text-3" id="text-70">

</div>

</div>

<div id="outline-container-71" class="outline-3">
<h3 id="sec-71">ADD-HOOK </h3>
<div class="outline-text-3" id="text-71">


</div>

<div id="outline-container-71-1" class="outline-4">
<h4 id="sec-71-1">Arguments </h4>
<div class="outline-text-4" id="text-71-1">

<p>(HOOK FUNC)
</p></div>

</div>

<div id="outline-container-71-2" class="outline-4">
<h4 id="sec-71-2">Documentation </h4>
<div class="outline-text-4" id="text-71-2">

<p>Arrange for FUNC to be invoked whenever HOOK is triggered with
`run-hook'. The function should have no arguments.
</p></div>
</div>

</div>

<div id="outline-container-72" class="outline-3">
<h3 id="sec-72">ADD-MESSAGE-VERBOSITIES </h3>
<div class="outline-text-3" id="text-72">


</div>

<div id="outline-container-72-1" class="outline-4">
<h4 id="sec-72-1">Arguments </h4>
<div class="outline-text-4" id="text-72-1">

<p>(PLIST)
</p></div>
</div>

</div>

<div id="outline-container-73" class="outline-3">
<h3 id="sec-73">ADD-OVERLAY </h3>
<div class="outline-text-3" id="text-73">

</div>

</div>

<div id="outline-container-74" class="outline-3">
<h3 id="sec-74">BIND-KEY-TO-METHOD </h3>
<div class="outline-text-3" id="text-74">


</div>

<div id="outline-container-74-1" class="outline-4">
<h4 id="sec-74-1">Arguments </h4>
<div class="outline-text-4" id="text-74-1">

<p>(P KEY MODIFIERS METHOD-KEYWORD)
</p></div>
</div>

</div>

<div id="outline-container-75" class="outline-3">
<h3 id="sec-75">BIND-KEY-TO-PROMPT-INSERTION </h3>
<div class="outline-text-3" id="text-75">


</div>

<div id="outline-container-75-1" class="outline-4">
<h4 id="sec-75-1">Arguments </h4>
<div class="outline-text-4" id="text-75-1">

<p>(P KEY MODIFIERS &amp;OPTIONAL (INSERTION KEY))
</p></div>
</div>

</div>

<div id="outline-container-76" class="outline-3">
<h3 id="sec-76">BROWSER </h3>
<div class="outline-text-3" id="text-76">

</div>

</div>

<div id="outline-container-77" class="outline-3">
<h3 id="sec-77">CLONE </h3>
<div class="outline-text-3" id="text-77">


</div>

<div id="outline-container-77-1" class="outline-4">
<h4 id="sec-77-1">Arguments </h4>
<div class="outline-text-4" id="text-77-1">

<p>(PROTOTYPE &amp;REST INITARGS)
</p></div>

</div>

<div id="outline-container-77-2" class="outline-4">
<h4 id="sec-77-2">Documentation </h4>
<div class="outline-text-4" id="text-77-2">

<p>Create a new object from PROTOTYPE and pass INITARGS to the
initializer. The new object is created with fields for which INITFORMS
were specified (if any; see `define-prototype'); the INITFORMS are
evaluated, then any applicable initializer is triggered.
</p></div>
</div>

</div>

<div id="outline-container-78" class="outline-3">
<h3 id="sec-78">COMPOSE-BLANK-FIELDS </h3>
<div class="outline-text-3" id="text-78">


</div>

<div id="outline-container-78-1" class="outline-4">
<h4 id="sec-78-1">Arguments </h4>
<div class="outline-text-4" id="text-78-1">

<p>(DESCRIPTORS)
</p></div>
</div>

</div>

<div id="outline-container-79" class="outline-3">
<h3 id="sec-79">CREATE-IMAGE </h3>
<div class="outline-text-3" id="text-79">


</div>

<div id="outline-container-79-1" class="outline-4">
<h4 id="sec-79-1">Arguments </h4>
<div class="outline-text-4" id="text-79-1">

<p>(WIDTH HEIGHT)
</p></div>

</div>

<div id="outline-container-79-2" class="outline-4">
<h4 id="sec-79-2">Documentation </h4>
<div class="outline-text-4" id="text-79-2">

<p>Create a new XE2 image of size (* WIDTH HEIGHT).
</p></div>
</div>

</div>

<div id="outline-container-80" class="outline-3">
<h3 id="sec-80">DEFCELL </h3>
<div class="outline-text-3" id="text-80">


</div>

<div id="outline-container-80-1" class="outline-4">
<h4 id="sec-80-1">Arguments </h4>
<div class="outline-text-4" id="text-80-1">

<p>(&amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-81" class="outline-3">
<h3 id="sec-81">DEFINE-METHOD </h3>
<div class="outline-text-3" id="text-81">


</div>

<div id="outline-container-81-1" class="outline-4">
<h4 id="sec-81-1">Arguments </h4>
<div class="outline-text-4" id="text-81-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-81-2" class="outline-4">
<h4 id="sec-81-2">Documentation </h4>
<div class="outline-text-4" id="text-81-2">

<p>Define a new method.
</p>
<p>
METHOD-NAME is a symbol naming the method.  PROTOTYPE-NAME is the name
of the prototype you are defining a method for. This should be a
symbol (without equals signs&mdash;see Prototype Names. ARGLIST is
the argument list for the method. If METHOD-BODY begins with a string,
this string becomes the documentation string for the method.
</p>
<p>
Any DECLARE forms must appear as the first non-string sexp.
</p>
<p>
The forms in METHOD-BODY are executed when the method is invoked.
The hidden argument `self' may be referred to as needed within
the method body; it is bound to the object upon which the method
was invoked.
</p></div>
</div>

</div>

<div id="outline-container-82" class="outline-3">
<h3 id="sec-82">DEFINE-PROTOTYPE </h3>
<div class="outline-text-3" id="text-82">


</div>

<div id="outline-container-82-1" class="outline-4">
<h4 id="sec-82-1">Arguments </h4>
<div class="outline-text-4" id="text-82-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-82-2" class="outline-4">
<h4 id="sec-82-2">Documentation </h4>
<div class="outline-text-4" id="text-82-2">

<p>Create a new object prototype (possibly based on another prototype).
</p>
<p>
NAME should be a symbol naming the prototype. A special variable is
created, with equals signs bracketing the name; this variable's value
is the resulting prototype. For example, if your prototype is named
`foo', the special variable will be named `=foo=', and you create
objects with:
</p>
<p>
 (clone <code>foo</code>)
</p>
<p>
See also `clone'. 
</p>
<p>
The second argument is a property list of options for the
prototype. Valid keys are:
</p>
<p>
 :DOCUMENTATION     The documentation string for this prototype.
 :PARENT            The parent prototype from which the new prototype will 
                    inherit fields. This form is evaluated.
</p>
<p>                     
DECLARATION-FIELD-DESCRIPTORS should be a list, each entry of which is
either a list of the form
</p>
<p>
  (FIELD-NAME . OPTIONS)
</p>
<p>
or, simply a symbol naming the field&mdash;a shorthand for declaring a
field with that name and no options. See also
`transform-declaration-field-descriptor'.
</p>
<p>
OPTIONS is a property list of field options. Valid keys are:
</p>
<p>
 :INITFORM          A form evaluated to initialize the field
                    upon cloning. If :initform is not provided,
                    the value is inherited from the PARENT.
                    With ":initform nil", the field is initialized 
                    with the value nil.
 :DOCUMENTATION     Documentation string for the field.
</p></div>
</div>

</div>
