notebook/rlx-doc.org
*** Documentation
Return general direction of the ray from R1,C1 to R2,C2.
** DIRECTORY-IS-MODULE-P
*** Arguments
(DIR)
*** Documentation
Test whether a PAK index file exists in a directory.
** DISABLE-HELD-KEYS
** DISABLE-TIMER
*** Documentation
Disable timer events.
** DISPATCH-EVENT
*** Arguments
(EVENT)
*** Documentation
Send EVENT to the handler function.
** DISTANCE
*** Arguments
(X1 Y1 X2 Y2)
*** Documentation
Compute the distance between the points X1,Y1 and X2,Y2.
** DO-CELLS
*** Arguments
(&REST ARGS)
** DRAW-BOX
*** Arguments
(X Y WIDTH HEIGHT &KEY (STROKE-COLOR .white) (COLOR .black) DESTINATION)
*** Documentation
Draw a filled rectangle at (X Y) of size (* WIDTH HEIGHT).
** DRAW-CIRCLE
*** Arguments
(X Y RADIUS &KEY (COLOR .white) DESTINATION)
** DRAW-IMAGE
*** Arguments
(IMAGE X Y &KEY (DESTINATION *DEFAULT-SURFACE*))
*** Documentation
Draw the IMAGE at offset (X Y) on the image DESTINATION.
The default destination is the main window.
** DRAW-LINE
*** Arguments
(X0 Y0 X1 Y1 &KEY (COLOR .white) DESTINATION)
** DRAW-PIXEL
*** Arguments
(X Y &KEY (COLOR .white) DESTINATION)
** DRAW-RECTANGLE
*** Arguments
(X Y WIDTH HEIGHT &KEY (COLOR .white) DESTINATION)
** DRAW-RESOURCE-IMAGE
*** Arguments
(NAME X Y &KEY (DESTINATION *DEFAULT-SURFACE*))
*** Documentation
Draw the image named by NAME at offset (X Y) on the image DESTINATION.
The default destination is the main window.
** DRAW-STRING-SHADED
*** Arguments
(STRING X Y &OPTIONAL (FOREGROUND .white) (BACKGROUND .black) &KEY DESTINATION
        (FONT *DEFAULT-FONT*))
** DRAW-STRING-SOLID
*** Arguments
(STRING X Y &KEY DESTINATION (FONT *DEFAULT-FONT*) (COLOR .white))
** ENABLE-HELD-KEYS
*** Arguments
(DELAY INTERVAL)
** ENABLE-TIMER
*** Documentation
Enable timer events. The next scheduled event will be the first sent.
** EXPANSIONS
*** Arguments
(VARIABLE)
** FIELD-OPTION-VALUE
*** Arguments
(FIELD OBJECT OPTION)
*** Documentation
Return the value of the OPTION for FIELD in OBJECT.
** FIELD-OPTIONS
*** Arguments
(FIELD OBJECT)
*** Documentation
Obtain the options property list for FIELD in OBJECT.
** FIELD-REFERENCE-P
*** Arguments
(FORM)
*** Documentation
Return non-nil if FORM is a symbol like <foo>.
** FIELD-VALUE
*** Arguments
(FIELD OBJECT &OPTIONAL NOERROR)
*** Documentation
Return the value of FIELD in OBJECT.
If the FIELD has no value in OBJECT, then the object's parent is also
checked, and so on. If a value is found during these checks, it is
returned. If a value cannot be found, an error of type `no-such-field'
is signaled, unless NOERROR is non-nil; in that case,
`*lookup-failure*' is returned. See also `has-field'.
** FIND-ALL-MODULES
** FIND-MODULE-PATH
*** Arguments
(MODULE-NAME)
*** Documentation
Search the `*module-directories*' path for a directory with the
name MODULE-NAME. Returns the pathname if found, otherwise nil.
** FIND-MODULES-IN-DIRECTORY
*** Arguments
(DIR)
*** Documentation
Search DIR for modules and return a list of their names.
** FIND-RESOURCE
*** Arguments
(NAME &OPTIONAL NOERROR)
*** Documentation
Obtain the resource named NAME, performing any necessary loading
and/or transformations. Unless NOERROR is non-nil, signal an error
when NAME cannot be found.
