notebook/rlx-doc.html

<div id="outline-container-83" class="outline-3">
<h3 id="sec-83">DEFSPRITE </h3>
<div class="outline-text-3" id="text-83">


</div>

<div id="outline-container-83-1" class="outline-4">
<h4 id="sec-83-1">Arguments </h4>
<div class="outline-text-4" id="text-83-1">

<p>(&amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-84" class="outline-3">
<h3 id="sec-84">DIRECTION-TO </h3>
<div class="outline-text-3" id="text-84">


</div>

<div id="outline-container-84-1" class="outline-4">
<h4 id="sec-84-1">Arguments </h4>
<div class="outline-text-4" id="text-84-1">

<p>(R1 C1 R2 C2)
</p></div>

</div>

<div id="outline-container-84-2" class="outline-4">
<h4 id="sec-84-2">Documentation </h4>
<div class="outline-text-4" id="text-84-2">

<p>Return general direction of the ray from R1,C1 to R2,C2.
</p></div>
</div>

</div>

<div id="outline-container-85" class="outline-3">
<h3 id="sec-85">DIRECTORY-IS-MODULE-P </h3>
<div class="outline-text-3" id="text-85">


</div>

<div id="outline-container-85-1" class="outline-4">
<h4 id="sec-85-1">Arguments </h4>
<div class="outline-text-4" id="text-85-1">

<p>(DIR)
</p></div>

</div>

<div id="outline-container-85-2" class="outline-4">
<h4 id="sec-85-2">Documentation </h4>
<div class="outline-text-4" id="text-85-2">

<p>Test whether a PAK index file exists in a directory.
</p></div>
</div>

</div>

<div id="outline-container-86" class="outline-3">
<h3 id="sec-86">DISABLE-HELD-KEYS </h3>
<div class="outline-text-3" id="text-86">

</div>

</div>

<div id="outline-container-87" class="outline-3">
<h3 id="sec-87">DISABLE-TIMER </h3>
<div class="outline-text-3" id="text-87">


</div>

<div id="outline-container-87-1" class="outline-4">
<h4 id="sec-87-1">Documentation </h4>
<div class="outline-text-4" id="text-87-1">

<p>Disable timer events.
</p></div>
</div>

</div>

<div id="outline-container-88" class="outline-3">
<h3 id="sec-88">DISPATCH-EVENT </h3>
<div class="outline-text-3" id="text-88">


</div>

<div id="outline-container-88-1" class="outline-4">
<h4 id="sec-88-1">Arguments </h4>
<div class="outline-text-4" id="text-88-1">

<p>(EVENT)
</p></div>

</div>

<div id="outline-container-88-2" class="outline-4">
<h4 id="sec-88-2">Documentation </h4>
<div class="outline-text-4" id="text-88-2">

<p>Send EVENT to the handler function.
</p></div>
</div>

</div>

<div id="outline-container-89" class="outline-3">
<h3 id="sec-89">DISTANCE </h3>
<div class="outline-text-3" id="text-89">


</div>

<div id="outline-container-89-1" class="outline-4">
<h4 id="sec-89-1">Arguments </h4>
<div class="outline-text-4" id="text-89-1">

<p>(X1 Y1 X2 Y2)
</p></div>

</div>

<div id="outline-container-89-2" class="outline-4">
<h4 id="sec-89-2">Documentation </h4>
<div class="outline-text-4" id="text-89-2">

<p>Compute the distance between the points X1,Y1 and X2,Y2.
</p></div>
</div>

</div>

<div id="outline-container-90" class="outline-3">
<h3 id="sec-90">DO-CELLS </h3>
<div class="outline-text-3" id="text-90">


</div>

<div id="outline-container-90-1" class="outline-4">
<h4 id="sec-90-1">Arguments </h4>
<div class="outline-text-4" id="text-90-1">

<p>(&amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-91" class="outline-3">
<h3 id="sec-91">DRAW-BOX </h3>
<div class="outline-text-3" id="text-91">


</div>

<div id="outline-container-91-1" class="outline-4">
<h4 id="sec-91-1">Arguments </h4>
<div class="outline-text-4" id="text-91-1">

<p>(X Y WIDTH HEIGHT &amp;KEY (STROKE-COLOR .white) (COLOR .black) DESTINATION)
</p></div>

</div>

<div id="outline-container-91-2" class="outline-4">
<h4 id="sec-91-2">Documentation </h4>
<div class="outline-text-4" id="text-91-2">

<p>Draw a filled rectangle at (X Y) of size (* WIDTH HEIGHT).
</p></div>
</div>

</div>

<div id="outline-container-92" class="outline-3">
<h3 id="sec-92">DRAW-CIRCLE </h3>
<div class="outline-text-3" id="text-92">


</div>

<div id="outline-container-92-1" class="outline-4">
<h4 id="sec-92-1">Arguments </h4>
<div class="outline-text-4" id="text-92-1">

<p>(X Y RADIUS &amp;KEY (COLOR .white) DESTINATION)
</p></div>
</div>

</div>

<div id="outline-container-93" class="outline-3">
<h3 id="sec-93">DRAW-IMAGE </h3>
<div class="outline-text-3" id="text-93">


</div>

<div id="outline-container-93-1" class="outline-4">
<h4 id="sec-93-1">Arguments </h4>
<div class="outline-text-4" id="text-93-1">

<p>(IMAGE X Y &amp;KEY (DESTINATION <b>DEFAULT-SURFACE</b>))
</p></div>

</div>

<div id="outline-container-93-2" class="outline-4">
<h4 id="sec-93-2">Documentation </h4>
<div class="outline-text-4" id="text-93-2">

<p>Draw the IMAGE at offset (X Y) on the image DESTINATION.
The default destination is the main window.
</p></div>
</div>

</div>

<div id="outline-container-94" class="outline-3">
<h3 id="sec-94">DRAW-LINE </h3>
<div class="outline-text-3" id="text-94">


</div>

<div id="outline-container-94-1" class="outline-4">
<h4 id="sec-94-1">Arguments </h4>
<div class="outline-text-4" id="text-94-1">

<p>(X0 Y0 X1 Y1 &amp;KEY (COLOR .white) DESTINATION)
</p></div>
</div>

</div>

<div id="outline-container-95" class="outline-3">
<h3 id="sec-95">DRAW-PIXEL </h3>
<div class="outline-text-3" id="text-95">


</div>

<div id="outline-container-95-1" class="outline-4">
<h4 id="sec-95-1">Arguments </h4>
<div class="outline-text-4" id="text-95-1">

<p>(X Y &amp;KEY (COLOR .white) DESTINATION)
</p></div>
</div>

</div>

<div id="outline-container-96" class="outline-3">
<h3 id="sec-96">DRAW-RECTANGLE </h3>
<div class="outline-text-3" id="text-96">


</div>

<div id="outline-container-96-1" class="outline-4">
<h4 id="sec-96-1">Arguments </h4>
<div class="outline-text-4" id="text-96-1">

<p>(X Y WIDTH HEIGHT &amp;KEY (COLOR .white) DESTINATION)
</p></div>
</div>

</div>

<div id="outline-container-97" class="outline-3">
<h3 id="sec-97">DRAW-RESOURCE-IMAGE </h3>
<div class="outline-text-3" id="text-97">


</div>

<div id="outline-container-97-1" class="outline-4">
<h4 id="sec-97-1">Arguments </h4>
<div class="outline-text-4" id="text-97-1">

<p>(NAME X Y &amp;KEY (DESTINATION <b>DEFAULT-SURFACE</b>))
</p></div>

</div>

<div id="outline-container-97-2" class="outline-4">
<h4 id="sec-97-2">Documentation </h4>
<div class="outline-text-4" id="text-97-2">

<p>Draw the image named by NAME at offset (X Y) on the image DESTINATION.
The default destination is the main window.
</p></div>
</div>

</div>

<div id="outline-container-98" class="outline-3">
<h3 id="sec-98">DRAW-STRING-SHADED </h3>
<div class="outline-text-3" id="text-98">


</div>

<div id="outline-container-98-1" class="outline-4">
<h4 id="sec-98-1">Arguments </h4>
<div class="outline-text-4" id="text-98-1">

<p>(STRING X Y &amp;OPTIONAL (FOREGROUND .white) (BACKGROUND .black) &amp;KEY DESTINATION
        (FONT <b>DEFAULT-FONT</b>))
</p></div>
</div>

</div>

<div id="outline-container-99" class="outline-3">
<h3 id="sec-99">DRAW-STRING-SOLID </h3>
<div class="outline-text-3" id="text-99">


</div>

<div id="outline-container-99-1" class="outline-4">
<h4 id="sec-99-1">Arguments </h4>
<div class="outline-text-4" id="text-99-1">

<p>(STRING X Y &amp;KEY DESTINATION (FONT <b>DEFAULT-FONT</b>) (COLOR .white))
</p></div>
</div>

</div>

<div id="outline-container-100" class="outline-3">
<h3 id="sec-100">ENABLE-HELD-KEYS </h3>
<div class="outline-text-3" id="text-100">


</div>

<div id="outline-container-100-1" class="outline-4">
<h4 id="sec-100-1">Arguments </h4>
<div class="outline-text-4" id="text-100-1">

<p>(DELAY INTERVAL)
</p></div>
</div>

</div>

<div id="outline-container-101" class="outline-3">
<h3 id="sec-101">ENABLE-TIMER </h3>
<div class="outline-text-3" id="text-101">


</div>

<div id="outline-container-101-1" class="outline-4">
<h4 id="sec-101-1">Documentation </h4>
<div class="outline-text-4" id="text-101-1">

<p>Enable timer events. The next scheduled event will be the first sent.
</p></div>
</div>

</div>

<div id="outline-container-102" class="outline-3">
<h3 id="sec-102">EXPANSIONS </h3>
<div class="outline-text-3" id="text-102">


</div>

<div id="outline-container-102-1" class="outline-4">
<h4 id="sec-102-1">Arguments </h4>
<div class="outline-text-4" id="text-102-1">

<p>(VARIABLE)
</p></div>
</div>

</div>

<div id="outline-container-103" class="outline-3">
<h3 id="sec-103">FIELD-OPTION-VALUE </h3>
<div class="outline-text-3" id="text-103">


</div>

<div id="outline-container-103-1" class="outline-4">
<h4 id="sec-103-1">Arguments </h4>
<div class="outline-text-4" id="text-103-1">

<p>(FIELD OBJECT OPTION)
</p></div>

</div>

<div id="outline-container-103-2" class="outline-4">
<h4 id="sec-103-2">Documentation </h4>
<div class="outline-text-4" id="text-103-2">

<p>Return the value of the OPTION for FIELD in OBJECT.
</p></div>
</div>

</div>

<div id="outline-container-104" class="outline-3">
<h3 id="sec-104">FIELD-OPTIONS </h3>
<div class="outline-text-3" id="text-104">


</div>

<div id="outline-container-104-1" class="outline-4">
<h4 id="sec-104-1">Arguments </h4>
<div class="outline-text-4" id="text-104-1">

<p>(FIELD OBJECT)
</p></div>

</div>

<div id="outline-container-104-2" class="outline-4">
<h4 id="sec-104-2">Documentation </h4>
<div class="outline-text-4" id="text-104-2">

<p>Obtain the options property list for FIELD in OBJECT.
</p></div>
</div>

</div>

<div id="outline-container-105" class="outline-3">
<h3 id="sec-105">FIELD-REFERENCE-P </h3>
<div class="outline-text-3" id="text-105">


</div>

<div id="outline-container-105-1" class="outline-4">
<h4 id="sec-105-1">Arguments </h4>
<div class="outline-text-4" id="text-105-1">

<p>(FORM)
</p></div>

</div>

<div id="outline-container-105-2" class="outline-4">
<h4 id="sec-105-2">Documentation </h4>
<div class="outline-text-4" id="text-105-2">

<p>Return non-nil if FORM is a symbol like &lt;foo&gt;.
</p></div>
</div>

</div>

<div id="outline-container-106" class="outline-3">
<h3 id="sec-106">FIELD-VALUE </h3>
<div class="outline-text-3" id="text-106">


</div>

<div id="outline-container-106-1" class="outline-4">
<h4 id="sec-106-1">Arguments </h4>
<div class="outline-text-4" id="text-106-1">

<p>(FIELD OBJECT &amp;OPTIONAL NOERROR)
</p></div>

</div>

<div id="outline-container-106-2" class="outline-4">
<h4 id="sec-106-2">Documentation </h4>
<div class="outline-text-4" id="text-106-2">

<p>Return the value of FIELD in OBJECT.
If the FIELD has no value in OBJECT, then the object's parent is also
checked, and so on. If a value is found during these checks, it is
returned. If a value cannot be found, an error of type `no-such-field'
is signaled, unless NOERROR is non-nil; in that case,
`*lookup-failure*' is returned. See also `has-field'.
</p></div>
</div>

</div>

<div id="outline-container-107" class="outline-3">
<h3 id="sec-107">FIND-ALL-MODULES </h3>
<div class="outline-text-3" id="text-107">

</div>

</div>

<div id="outline-container-108" class="outline-3">
<h3 id="sec-108">FIND-MODULE-PATH </h3>
<div class="outline-text-3" id="text-108">


</div>

<div id="outline-container-108-1" class="outline-4">
<h4 id="sec-108-1">Arguments </h4>
<div class="outline-text-4" id="text-108-1">

<p>(MODULE-NAME)
</p></div>

</div>

<div id="outline-container-108-2" class="outline-4">
<h4 id="sec-108-2">Documentation </h4>
<div class="outline-text-4" id="text-108-2">

<p>Search the `*module-directories*' path for a directory with the
name MODULE-NAME. Returns the pathname if found, otherwise nil.
</p></div>
</div>

</div>

<div id="outline-container-109" class="outline-3">
<h3 id="sec-109">FIND-MODULES-IN-DIRECTORY </h3>
<div class="outline-text-3" id="text-109">


</div>

<div id="outline-container-109-1" class="outline-4">
<h4 id="sec-109-1">Arguments </h4>
<div class="outline-text-4" id="text-109-1">

<p>(DIR)
</p></div>

</div>

<div id="outline-container-109-2" class="outline-4">
<h4 id="sec-109-2">Documentation </h4>
<div class="outline-text-4" id="text-109-2">

<p>Search DIR for modules and return a list of their names.
</p></div>
</div>

</div>

<div id="outline-container-110" class="outline-3">
<h3 id="sec-110">FIND-RESOURCE </h3>
<div class="outline-text-3" id="text-110">


</div>

<div id="outline-container-110-1" class="outline-4">
<h4 id="sec-110-1">Arguments </h4>
<div class="outline-text-4" id="text-110-1">

<p>(NAME &amp;OPTIONAL NOERROR)
</p></div>

</div>

<div id="outline-container-110-2" class="outline-4">
<h4 id="sec-110-2">Documentation </h4>
<div class="outline-text-4" id="text-110-2">

<p>Obtain the resource named NAME, performing any necessary loading
and/or transformations. Unless NOERROR is non-nil, signal an error
when NAME cannot be found.
</p></div>
</div>

</div>
