notebook/rlx-doc.org
** FIND-RESOURCE-OBJECT
*** Arguments
(NAME)
*** Documentation
Obtain the resource object named NAME, or signal an error if not
found.
** FIND-RESOURCE-PROPERTY
*** Arguments
(RESOURCE-NAME PROPERTY)
*** Documentation
Read the value of PROPERTY from the resource RESOURCE-NAME.
** FONT-HEIGHT
*** Arguments
(FONT)
** FONT-TEXT-EXTENTS
*** Arguments
(STRING FONT)
** FONT-WIDTH
*** Arguments
(FONT)
** FORMATTED-STRING-HEIGHT
*** Arguments
(S)
** FORMATTED-STRING-WIDTH
*** Arguments
(S)
** GENERATE
*** Arguments
(PHRASE)
*** Documentation
Generate a random phrase using the grammar in `*grammar*'.
** GENSEQ
*** Arguments
(&OPTIONAL (X 0))
** GET-COLOR
** GET-SOME-OBJECT-NAME
*** Arguments
(OB)
** GOAL
** HALT-MUSIC
*** Arguments
(FADE-MILLISECONDS)
** HAS-FIELD
*** Arguments
(FIELD OBJECT)
*** Documentation
Return non-nil if FIELD has any value in OBJECT.
** ICON-IMAGE
*** Arguments
(KEY)
*** Documentation
Return an icon image name for KEY.
** ICON-RESOURCE
*** Arguments
(KEY)
*** Documentation
Return an icon resource for the key KEY.
The standard GEAR icon is used when no other applicable icon can be
found.
** INDEX-MODULE
*** Arguments
(MODULE-NAME)
*** Documentation
Add all the resources from the module MODULE-NAME to the resource
table.
** INDEX-RESOURCE
*** Arguments
(RESOURCE)
*** Documentation
Add the RESOURCE's record to the resource table.
If a record with that name already exists, it is replaced.  However,
if the resource is an :alias, just the string name of the target
resource is stored; see also `find-resource'.
** INITIALIZE-COLORS
*** Documentation
Load the X11 color data into the resource table.
** INITIALIZE-ENGINE
** INITIALIZE-RESOURCE-TABLE
** INSTALL-WIDGETS
*** Arguments
(&REST WIDGETS)
*** Documentation
User-level function for setting the active widget set. Note that
XE2 may override the current widget set at any time for system menus
and the like.
** IS-ZOOMED-RESOURCE
*** Arguments
(RESOURCE)
** LEFT-HAND-SIDE
*** Arguments
(RULE)
** LOAD-FONT-RESOURCE
*** Arguments
(RESOURCE)
** LOAD-IMAGE-RESOURCE
*** Arguments
(RESOURCE)
** LOAD-LISP-RESOURCE
*** Arguments
(RESOURCE)
** LOAD-MODULE
*** Arguments
(MODULE)
** LOAD-RESOURCE
*** Arguments
(RESOURCE)
*** Documentation
Load the driver-dependent object of RESOURCE into the OBJECT field
so that it can be fed to the console.
** LOAD-USER-INIT-FILE
** MAKE-EVENT
*** Arguments
(SDL-KEY SDL-MODS)
*** Documentation
Create a normalized event out of the SDL data SDL-KEY and SDL-MODS.
** MAKE-FIELD-INITIALIZER
*** Arguments
(DESCRIPTOR)
*** Documentation
Create a setf statement that initializes a field.
The initform is taken from DESCRIPTOR. If there is no initform
specified, no setf statement is generated, because in this case the
slot value is inherited.
** MAKE-FIELD-INITIALIZER-BODY
** MAKE-FORMATTED-STRING
** MAKE-KEY-MODIFIER-SYMBOL
*** Arguments
(SDL-MOD)
