notebook/rlx-doc.html

<div id="outline-container-111" class="outline-3">
<h3 id="sec-111">FIND-RESOURCE-OBJECT </h3>
<div class="outline-text-3" id="text-111">


</div>

<div id="outline-container-111-1" class="outline-4">
<h4 id="sec-111-1">Arguments </h4>
<div class="outline-text-4" id="text-111-1">

<p>(NAME)
</p></div>

</div>

<div id="outline-container-111-2" class="outline-4">
<h4 id="sec-111-2">Documentation </h4>
<div class="outline-text-4" id="text-111-2">

<p>Obtain the resource object named NAME, or signal an error if not
found.
</p></div>
</div>

</div>

<div id="outline-container-112" class="outline-3">
<h3 id="sec-112">FIND-RESOURCE-PROPERTY </h3>
<div class="outline-text-3" id="text-112">


</div>

<div id="outline-container-112-1" class="outline-4">
<h4 id="sec-112-1">Arguments </h4>
<div class="outline-text-4" id="text-112-1">

<p>(RESOURCE-NAME PROPERTY)
</p></div>

</div>

<div id="outline-container-112-2" class="outline-4">
<h4 id="sec-112-2">Documentation </h4>
<div class="outline-text-4" id="text-112-2">

<p>Read the value of PROPERTY from the resource RESOURCE-NAME.
</p></div>
</div>

</div>

<div id="outline-container-113" class="outline-3">
<h3 id="sec-113">FONT-HEIGHT </h3>
<div class="outline-text-3" id="text-113">


</div>

<div id="outline-container-113-1" class="outline-4">
<h4 id="sec-113-1">Arguments </h4>
<div class="outline-text-4" id="text-113-1">

<p>(FONT)
</p></div>
</div>

</div>

<div id="outline-container-114" class="outline-3">
<h3 id="sec-114">FONT-TEXT-EXTENTS </h3>
<div class="outline-text-3" id="text-114">


</div>

<div id="outline-container-114-1" class="outline-4">
<h4 id="sec-114-1">Arguments </h4>
<div class="outline-text-4" id="text-114-1">

<p>(STRING FONT)
</p></div>
</div>

</div>

<div id="outline-container-115" class="outline-3">
<h3 id="sec-115">FONT-WIDTH </h3>
<div class="outline-text-3" id="text-115">


</div>

<div id="outline-container-115-1" class="outline-4">
<h4 id="sec-115-1">Arguments </h4>
<div class="outline-text-4" id="text-115-1">

<p>(FONT)
</p></div>
</div>

</div>

<div id="outline-container-116" class="outline-3">
<h3 id="sec-116">FORMATTED-STRING-HEIGHT </h3>
<div class="outline-text-3" id="text-116">


</div>

<div id="outline-container-116-1" class="outline-4">
<h4 id="sec-116-1">Arguments </h4>
<div class="outline-text-4" id="text-116-1">

<p>(S)
</p></div>
</div>

</div>

<div id="outline-container-117" class="outline-3">
<h3 id="sec-117">FORMATTED-STRING-WIDTH </h3>
<div class="outline-text-3" id="text-117">


</div>

<div id="outline-container-117-1" class="outline-4">
<h4 id="sec-117-1">Arguments </h4>
<div class="outline-text-4" id="text-117-1">

<p>(S)
</p></div>
</div>

</div>

<div id="outline-container-118" class="outline-3">
<h3 id="sec-118">GENERATE </h3>
<div class="outline-text-3" id="text-118">


</div>

<div id="outline-container-118-1" class="outline-4">
<h4 id="sec-118-1">Arguments </h4>
<div class="outline-text-4" id="text-118-1">

<p>(PHRASE)
</p></div>

</div>

<div id="outline-container-118-2" class="outline-4">
<h4 id="sec-118-2">Documentation </h4>
<div class="outline-text-4" id="text-118-2">

<p>Generate a random phrase using the grammar in `*grammar*'.
</p></div>
</div>

</div>

<div id="outline-container-119" class="outline-3">
<h3 id="sec-119">GENSEQ </h3>
<div class="outline-text-3" id="text-119">


</div>

<div id="outline-container-119-1" class="outline-4">
<h4 id="sec-119-1">Arguments </h4>
<div class="outline-text-4" id="text-119-1">

<p>(&amp;OPTIONAL (X 0))
</p></div>
</div>

</div>

<div id="outline-container-120" class="outline-3">
<h3 id="sec-120">GET-COLOR </h3>
<div class="outline-text-3" id="text-120">

</div>

</div>

<div id="outline-container-121" class="outline-3">
<h3 id="sec-121">GET-SOME-OBJECT-NAME </h3>
<div class="outline-text-3" id="text-121">


</div>

<div id="outline-container-121-1" class="outline-4">
<h4 id="sec-121-1">Arguments </h4>
<div class="outline-text-4" id="text-121-1">

<p>(OB)
</p></div>
</div>

</div>

<div id="outline-container-122" class="outline-3">
<h3 id="sec-122">GOAL </h3>
<div class="outline-text-3" id="text-122">

</div>

</div>

<div id="outline-container-123" class="outline-3">
<h3 id="sec-123">HALT-MUSIC </h3>
<div class="outline-text-3" id="text-123">


</div>

<div id="outline-container-123-1" class="outline-4">
<h4 id="sec-123-1">Arguments </h4>
<div class="outline-text-4" id="text-123-1">

<p>(FADE-MILLISECONDS)
</p></div>
</div>

</div>

<div id="outline-container-124" class="outline-3">
<h3 id="sec-124">HAS-FIELD </h3>
<div class="outline-text-3" id="text-124">


</div>

<div id="outline-container-124-1" class="outline-4">
<h4 id="sec-124-1">Arguments </h4>
<div class="outline-text-4" id="text-124-1">

<p>(FIELD OBJECT)
</p></div>

</div>

<div id="outline-container-124-2" class="outline-4">
<h4 id="sec-124-2">Documentation </h4>
<div class="outline-text-4" id="text-124-2">

<p>Return non-nil if FIELD has any value in OBJECT.
</p></div>
</div>

</div>

<div id="outline-container-125" class="outline-3">
<h3 id="sec-125">ICON-IMAGE </h3>
<div class="outline-text-3" id="text-125">


</div>

<div id="outline-container-125-1" class="outline-4">
<h4 id="sec-125-1">Arguments </h4>
<div class="outline-text-4" id="text-125-1">

<p>(KEY)
</p></div>

</div>

<div id="outline-container-125-2" class="outline-4">
<h4 id="sec-125-2">Documentation </h4>
<div class="outline-text-4" id="text-125-2">

<p>Return an icon image name for KEY.
</p></div>
</div>

</div>

<div id="outline-container-126" class="outline-3">
<h3 id="sec-126">ICON-RESOURCE </h3>
<div class="outline-text-3" id="text-126">


</div>

<div id="outline-container-126-1" class="outline-4">
<h4 id="sec-126-1">Arguments </h4>
<div class="outline-text-4" id="text-126-1">

<p>(KEY)
</p></div>

</div>

<div id="outline-container-126-2" class="outline-4">
<h4 id="sec-126-2">Documentation </h4>
<div class="outline-text-4" id="text-126-2">

<p>Return an icon resource for the key KEY.
The standard GEAR icon is used when no other applicable icon can be
found.
</p></div>
</div>

</div>

<div id="outline-container-127" class="outline-3">
<h3 id="sec-127">INDEX-MODULE </h3>
<div class="outline-text-3" id="text-127">


</div>

<div id="outline-container-127-1" class="outline-4">
<h4 id="sec-127-1">Arguments </h4>
<div class="outline-text-4" id="text-127-1">

<p>(MODULE-NAME)
</p></div>

</div>

<div id="outline-container-127-2" class="outline-4">
<h4 id="sec-127-2">Documentation </h4>
<div class="outline-text-4" id="text-127-2">

<p>Add all the resources from the module MODULE-NAME to the resource
table.
</p></div>
</div>

</div>

<div id="outline-container-128" class="outline-3">
<h3 id="sec-128">INDEX-RESOURCE </h3>
<div class="outline-text-3" id="text-128">


</div>

<div id="outline-container-128-1" class="outline-4">
<h4 id="sec-128-1">Arguments </h4>
<div class="outline-text-4" id="text-128-1">

<p>(RESOURCE)
</p></div>

</div>

<div id="outline-container-128-2" class="outline-4">
<h4 id="sec-128-2">Documentation </h4>
<div class="outline-text-4" id="text-128-2">

<p>Add the RESOURCE's record to the resource table.
If a record with that name already exists, it is replaced.  However,
if the resource is an :alias, just the string name of the target
resource is stored; see also `find-resource'.
</p></div>
</div>

</div>

<div id="outline-container-129" class="outline-3">
<h3 id="sec-129">INITIALIZE-COLORS </h3>
<div class="outline-text-3" id="text-129">


</div>

<div id="outline-container-129-1" class="outline-4">
<h4 id="sec-129-1">Documentation </h4>
<div class="outline-text-4" id="text-129-1">

<p>Load the X11 color data into the resource table.
</p></div>
</div>

</div>

<div id="outline-container-130" class="outline-3">
<h3 id="sec-130">INITIALIZE-ENGINE </h3>
<div class="outline-text-3" id="text-130">

</div>

</div>

<div id="outline-container-131" class="outline-3">
<h3 id="sec-131">INITIALIZE-RESOURCE-TABLE </h3>
<div class="outline-text-3" id="text-131">

</div>

</div>

<div id="outline-container-132" class="outline-3">
<h3 id="sec-132">INSTALL-WIDGETS </h3>
<div class="outline-text-3" id="text-132">


</div>

<div id="outline-container-132-1" class="outline-4">
<h4 id="sec-132-1">Arguments </h4>
<div class="outline-text-4" id="text-132-1">

<p>(&amp;REST WIDGETS)
</p></div>

</div>

<div id="outline-container-132-2" class="outline-4">
<h4 id="sec-132-2">Documentation </h4>
<div class="outline-text-4" id="text-132-2">

<p>User-level function for setting the active widget set. Note that
XE2 may override the current widget set at any time for system menus
and the like.
</p></div>
</div>

</div>

<div id="outline-container-133" class="outline-3">
<h3 id="sec-133">IS-ZOOMED-RESOURCE </h3>
<div class="outline-text-3" id="text-133">


</div>

<div id="outline-container-133-1" class="outline-4">
<h4 id="sec-133-1">Arguments </h4>
<div class="outline-text-4" id="text-133-1">

<p>(RESOURCE)
</p></div>
</div>

</div>

<div id="outline-container-134" class="outline-3">
<h3 id="sec-134">LEFT-HAND-SIDE </h3>
<div class="outline-text-3" id="text-134">


</div>

<div id="outline-container-134-1" class="outline-4">
<h4 id="sec-134-1">Arguments </h4>
<div class="outline-text-4" id="text-134-1">

<p>(RULE)
</p></div>
</div>

</div>

<div id="outline-container-135" class="outline-3">
<h3 id="sec-135">LOAD-FONT-RESOURCE </h3>
<div class="outline-text-3" id="text-135">


</div>

<div id="outline-container-135-1" class="outline-4">
<h4 id="sec-135-1">Arguments </h4>
<div class="outline-text-4" id="text-135-1">

<p>(RESOURCE)
</p></div>
</div>

</div>

<div id="outline-container-136" class="outline-3">
<h3 id="sec-136">LOAD-IMAGE-RESOURCE </h3>
<div class="outline-text-3" id="text-136">


</div>

<div id="outline-container-136-1" class="outline-4">
<h4 id="sec-136-1">Arguments </h4>
<div class="outline-text-4" id="text-136-1">

<p>(RESOURCE)
</p></div>
</div>

</div>

<div id="outline-container-137" class="outline-3">
<h3 id="sec-137">LOAD-LISP-RESOURCE </h3>
<div class="outline-text-3" id="text-137">


</div>

<div id="outline-container-137-1" class="outline-4">
<h4 id="sec-137-1">Arguments </h4>
<div class="outline-text-4" id="text-137-1">

<p>(RESOURCE)
</p></div>
</div>

</div>

<div id="outline-container-138" class="outline-3">
<h3 id="sec-138">LOAD-MODULE </h3>
<div class="outline-text-3" id="text-138">


</div>

<div id="outline-container-138-1" class="outline-4">
<h4 id="sec-138-1">Arguments </h4>
<div class="outline-text-4" id="text-138-1">

<p>(MODULE)
</p></div>
</div>

</div>

<div id="outline-container-139" class="outline-3">
<h3 id="sec-139">LOAD-RESOURCE </h3>
<div class="outline-text-3" id="text-139">


</div>

<div id="outline-container-139-1" class="outline-4">
<h4 id="sec-139-1">Arguments </h4>
<div class="outline-text-4" id="text-139-1">

<p>(RESOURCE)
</p></div>

</div>

<div id="outline-container-139-2" class="outline-4">
<h4 id="sec-139-2">Documentation </h4>
<div class="outline-text-4" id="text-139-2">

<p>Load the driver-dependent object of RESOURCE into the OBJECT field
so that it can be fed to the console.
</p></div>
</div>

</div>

<div id="outline-container-140" class="outline-3">
<h3 id="sec-140">LOAD-USER-INIT-FILE </h3>
<div class="outline-text-3" id="text-140">

</div>

</div>

<div id="outline-container-141" class="outline-3">
<h3 id="sec-141">MAKE-EVENT </h3>
<div class="outline-text-3" id="text-141">


</div>

<div id="outline-container-141-1" class="outline-4">
<h4 id="sec-141-1">Arguments </h4>
<div class="outline-text-4" id="text-141-1">

<p>(SDL-KEY SDL-MODS)
</p></div>

</div>

<div id="outline-container-141-2" class="outline-4">
<h4 id="sec-141-2">Documentation </h4>
<div class="outline-text-4" id="text-141-2">

<p>Create a normalized event out of the SDL data SDL-KEY and SDL-MODS.
</p></div>
</div>

</div>

<div id="outline-container-142" class="outline-3">
<h3 id="sec-142">MAKE-FIELD-INITIALIZER </h3>
<div class="outline-text-3" id="text-142">


</div>

<div id="outline-container-142-1" class="outline-4">
<h4 id="sec-142-1">Arguments </h4>
<div class="outline-text-4" id="text-142-1">

<p>(DESCRIPTOR)
</p></div>

</div>

<div id="outline-container-142-2" class="outline-4">
<h4 id="sec-142-2">Documentation </h4>
<div class="outline-text-4" id="text-142-2">

<p>Create a setf statement that initializes a field.
The initform is taken from DESCRIPTOR. If there is no initform
specified, no setf statement is generated, because in this case the
slot value is inherited.
</p></div>
</div>

</div>

<div id="outline-container-143" class="outline-3">
<h3 id="sec-143">MAKE-FIELD-INITIALIZER-BODY </h3>
<div class="outline-text-3" id="text-143">

</div>

</div>

<div id="outline-container-144" class="outline-3">
<h3 id="sec-144">MAKE-FORMATTED-STRING </h3>
<div class="outline-text-3" id="text-144">

</div>

</div>

<div id="outline-container-145" class="outline-3">
<h3 id="sec-145">MAKE-KEY-MODIFIER-SYMBOL </h3>
<div class="outline-text-3" id="text-145">


</div>
