notebook/rlx-doc.org
*** Documentation
Translate from the SDL key modifier symbol SDL-MOD to our own
key event symbols.
** MAKE-KEY-STRING
*** Arguments
(SDL-KEY)
*** Documentation
Translate from :SDL-KEY-X to the string "X".
** MAKE-KEYWORD
*** Arguments
(S)
*** Documentation
Make the symbol or string S into a keyword symbol.
** MAKE-OBJECT
** MAKE-QUEUE
*** Arguments
(&KEY ((HEAD DUM412) NIL) ((TAIL DUM413) NIL) ((COUNT DUM414) NIL)
 ((MAX DUM415) NIL))
** MAKE-SPECIAL-VARIABLE-NAME
*** Arguments
(S)
*** Documentation
Make the symbol S into a special variable name. This is used to
make the names of the objects made with `define-prototype'.
** MAKE-STAT
*** Arguments
(&KEY BASE MIN MAX DELTA UNIT)
** MESSAGE
*** Arguments
(FORMAT-STRING &REST ARGS)
*** Documentation
Print a log message to the standard output.
** MESSAGE-SYMBOL
*** Arguments
(STRING DELIMITER)
** MIDPOINT
*** Arguments
(A B)
** NO-SUCH-FIELD
** NORMALIZE-EVENT
*** Arguments
(EVENT)
*** Documentation
Convert EVENT to a normal form suitable for `equal' comparisons.
** NULL-PARENT
** OBJECT
*** Arguments
(CONDITION)
** OBJECT-ADDRESS-STRING
*** Arguments
(OB)
** OBJECT-FIELDS
*** Arguments
(INSTANCE)
** OBJECT-NAME
*** Arguments
(INSTANCE)
** OBJECT-PARENT
*** Arguments
(INSTANCE)
** ONE-OF
*** Arguments
(SET)
** OPERATION-SYMBOL
*** Arguments
(STRING DELIMITER)
** OPPOSITE-DIRECTION
*** Arguments
(DIRECTION)
*** Documentation
Return the direction keyword that is the opposite direction from
DIRECTION.
** OVERLAY
** PERCENT-OF-TIME
*** Arguments
(&REST ARGS)
** PLASMA-RECT
** PLAY
*** Arguments
(&OPTIONAL (MODULE-NAME standard))
** PLAY-MUSIC
*** Arguments
(MUSIC-NAME &REST ARGS)
** PLAY-SAMPLE
*** Arguments
(SAMPLE-NAME &REST ARGS)
** POLL-JOYSTICK-AXIS
*** Arguments
(AXIS)
** QUEUE
*** Arguments
(ITEM Q)
** QUEUE-COUNT
** QUEUE-HEAD
** QUEUE-MAX
** QUEUE-MESSAGE
*** Arguments
(SENDER METHOD-KEY RECEIVER ARGS)
*** Documentation
Enter a message into the current `*message-queue*'.
** QUEUE-TAIL
** QUEUED-MESSAGES-P
*** Documentation
Return non-nil if there are queued messages.
** QUIT
*** Arguments
(&OPTIONAL SHUTDOWN)
** RANDOM-DIRECTION
** READ-PAK
*** Arguments
(FILENAME)
*** Documentation
Return a list of resources from the PAK file FILENAME.
** READ-SEXP-FROM-FILE
*** Arguments
(FILENAME)
** RENDER-FORMATTED-LINE
*** Arguments
(LINE X Y &KEY DESTINATION (FONT *DEFAULT-FONT*))
*** Documentation
Render the formatted LINE at position X,Y on the image DESTINATION.
Return the height of the rendered line.
