notebook/rlx-doc.html

<div id="outline-container-145-1" class="outline-4">
<h4 id="sec-145-1">Arguments </h4>
<div class="outline-text-4" id="text-145-1">

<p>(SDL-MOD)
</p></div>

</div>

<div id="outline-container-145-2" class="outline-4">
<h4 id="sec-145-2">Documentation </h4>
<div class="outline-text-4" id="text-145-2">

<p>Translate from the SDL key modifier symbol SDL-MOD to our own
key event symbols.
</p></div>
</div>

</div>

<div id="outline-container-146" class="outline-3">
<h3 id="sec-146">MAKE-KEY-STRING </h3>
<div class="outline-text-3" id="text-146">


</div>

<div id="outline-container-146-1" class="outline-4">
<h4 id="sec-146-1">Arguments </h4>
<div class="outline-text-4" id="text-146-1">

<p>(SDL-KEY)
</p></div>

</div>

<div id="outline-container-146-2" class="outline-4">
<h4 id="sec-146-2">Documentation </h4>
<div class="outline-text-4" id="text-146-2">

<p>Translate from :SDL-KEY-X to the string "X".
</p></div>
</div>

</div>

<div id="outline-container-147" class="outline-3">
<h3 id="sec-147">MAKE-KEYWORD </h3>
<div class="outline-text-3" id="text-147">


</div>

<div id="outline-container-147-1" class="outline-4">
<h4 id="sec-147-1">Arguments </h4>
<div class="outline-text-4" id="text-147-1">

<p>(S)
</p></div>

</div>

<div id="outline-container-147-2" class="outline-4">
<h4 id="sec-147-2">Documentation </h4>
<div class="outline-text-4" id="text-147-2">

<p>Make the symbol or string S into a keyword symbol.
</p></div>
</div>

</div>

<div id="outline-container-148" class="outline-3">
<h3 id="sec-148">MAKE-OBJECT </h3>
<div class="outline-text-3" id="text-148">

</div>

</div>

<div id="outline-container-149" class="outline-3">
<h3 id="sec-149">MAKE-QUEUE </h3>
<div class="outline-text-3" id="text-149">


</div>

<div id="outline-container-149-1" class="outline-4">
<h4 id="sec-149-1">Arguments </h4>
<div class="outline-text-4" id="text-149-1">

<p>(&amp;KEY ((HEAD DUM412) NIL) ((TAIL DUM413) NIL) ((COUNT DUM414) NIL)
 ((MAX DUM415) NIL))
</p></div>
</div>

</div>

<div id="outline-container-150" class="outline-3">
<h3 id="sec-150">MAKE-SPECIAL-VARIABLE-NAME </h3>
<div class="outline-text-3" id="text-150">


</div>

<div id="outline-container-150-1" class="outline-4">
<h4 id="sec-150-1">Arguments </h4>
<div class="outline-text-4" id="text-150-1">

<p>(S)
</p></div>

</div>

<div id="outline-container-150-2" class="outline-4">
<h4 id="sec-150-2">Documentation </h4>
<div class="outline-text-4" id="text-150-2">

<p>Make the symbol S into a special variable name. This is used to
make the names of the objects made with `define-prototype'.
</p></div>
</div>

</div>

<div id="outline-container-151" class="outline-3">
<h3 id="sec-151">MAKE-STAT </h3>
<div class="outline-text-3" id="text-151">


</div>

<div id="outline-container-151-1" class="outline-4">
<h4 id="sec-151-1">Arguments </h4>
<div class="outline-text-4" id="text-151-1">

<p>(&amp;KEY BASE MIN MAX DELTA UNIT)
</p></div>
</div>

</div>

<div id="outline-container-152" class="outline-3">
<h3 id="sec-152">MESSAGE </h3>
<div class="outline-text-3" id="text-152">


</div>

<div id="outline-container-152-1" class="outline-4">
<h4 id="sec-152-1">Arguments </h4>
<div class="outline-text-4" id="text-152-1">

<p>(FORMAT-STRING &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-152-2" class="outline-4">
<h4 id="sec-152-2">Documentation </h4>
<div class="outline-text-4" id="text-152-2">

<p>Print a log message to the standard output.
</p></div>
</div>

</div>

<div id="outline-container-153" class="outline-3">
<h3 id="sec-153">MESSAGE-SYMBOL </h3>
<div class="outline-text-3" id="text-153">


</div>

<div id="outline-container-153-1" class="outline-4">
<h4 id="sec-153-1">Arguments </h4>
<div class="outline-text-4" id="text-153-1">

<p>(STRING DELIMITER)
</p></div>
</div>

</div>

<div id="outline-container-154" class="outline-3">
<h3 id="sec-154">MIDPOINT </h3>
<div class="outline-text-3" id="text-154">


</div>

<div id="outline-container-154-1" class="outline-4">
<h4 id="sec-154-1">Arguments </h4>
<div class="outline-text-4" id="text-154-1">

<p>(A B)
</p></div>
</div>

</div>

<div id="outline-container-155" class="outline-3">
<h3 id="sec-155">NO-SUCH-FIELD </h3>
<div class="outline-text-3" id="text-155">

</div>

</div>

<div id="outline-container-156" class="outline-3">
<h3 id="sec-156">NORMALIZE-EVENT </h3>
<div class="outline-text-3" id="text-156">


</div>

<div id="outline-container-156-1" class="outline-4">
<h4 id="sec-156-1">Arguments </h4>
<div class="outline-text-4" id="text-156-1">

<p>(EVENT)
</p></div>

</div>

<div id="outline-container-156-2" class="outline-4">
<h4 id="sec-156-2">Documentation </h4>
<div class="outline-text-4" id="text-156-2">

<p>Convert EVENT to a normal form suitable for `equal' comparisons.
</p></div>
</div>

</div>

<div id="outline-container-157" class="outline-3">
<h3 id="sec-157">NULL-PARENT </h3>
<div class="outline-text-3" id="text-157">

</div>

</div>

<div id="outline-container-158" class="outline-3">
<h3 id="sec-158">OBJECT </h3>
<div class="outline-text-3" id="text-158">


</div>

<div id="outline-container-158-1" class="outline-4">
<h4 id="sec-158-1">Arguments </h4>
<div class="outline-text-4" id="text-158-1">

<p>(CONDITION)
</p></div>
</div>

</div>

<div id="outline-container-159" class="outline-3">
<h3 id="sec-159">OBJECT-ADDRESS-STRING </h3>
<div class="outline-text-3" id="text-159">


</div>

<div id="outline-container-159-1" class="outline-4">
<h4 id="sec-159-1">Arguments </h4>
<div class="outline-text-4" id="text-159-1">

<p>(OB)
</p></div>
</div>

</div>

<div id="outline-container-160" class="outline-3">
<h3 id="sec-160">OBJECT-FIELDS </h3>
<div class="outline-text-3" id="text-160">


</div>

<div id="outline-container-160-1" class="outline-4">
<h4 id="sec-160-1">Arguments </h4>
<div class="outline-text-4" id="text-160-1">

<p>(INSTANCE)
</p></div>
</div>

</div>

<div id="outline-container-161" class="outline-3">
<h3 id="sec-161">OBJECT-NAME </h3>
<div class="outline-text-3" id="text-161">


</div>

<div id="outline-container-161-1" class="outline-4">
<h4 id="sec-161-1">Arguments </h4>
<div class="outline-text-4" id="text-161-1">

<p>(INSTANCE)
</p></div>
</div>

</div>

<div id="outline-container-162" class="outline-3">
<h3 id="sec-162">OBJECT-PARENT </h3>
<div class="outline-text-3" id="text-162">


</div>

<div id="outline-container-162-1" class="outline-4">
<h4 id="sec-162-1">Arguments </h4>
<div class="outline-text-4" id="text-162-1">

<p>(INSTANCE)
</p></div>
</div>

</div>

<div id="outline-container-163" class="outline-3">
<h3 id="sec-163">ONE-OF </h3>
<div class="outline-text-3" id="text-163">


</div>

<div id="outline-container-163-1" class="outline-4">
<h4 id="sec-163-1">Arguments </h4>
<div class="outline-text-4" id="text-163-1">

<p>(SET)
</p></div>
</div>

</div>

<div id="outline-container-164" class="outline-3">
<h3 id="sec-164">OPERATION-SYMBOL </h3>
<div class="outline-text-3" id="text-164">


</div>

<div id="outline-container-164-1" class="outline-4">
<h4 id="sec-164-1">Arguments </h4>
<div class="outline-text-4" id="text-164-1">

<p>(STRING DELIMITER)
</p></div>
</div>

</div>

<div id="outline-container-165" class="outline-3">
<h3 id="sec-165">OPPOSITE-DIRECTION </h3>
<div class="outline-text-3" id="text-165">


</div>

<div id="outline-container-165-1" class="outline-4">
<h4 id="sec-165-1">Arguments </h4>
<div class="outline-text-4" id="text-165-1">

<p>(DIRECTION)
</p></div>

</div>

<div id="outline-container-165-2" class="outline-4">
<h4 id="sec-165-2">Documentation </h4>
<div class="outline-text-4" id="text-165-2">

<p>Return the direction keyword that is the opposite direction from
DIRECTION.
</p></div>
</div>

</div>

<div id="outline-container-166" class="outline-3">
<h3 id="sec-166">OVERLAY </h3>
<div class="outline-text-3" id="text-166">

</div>

</div>

<div id="outline-container-167" class="outline-3">
<h3 id="sec-167">PERCENT-OF-TIME </h3>
<div class="outline-text-3" id="text-167">


</div>

<div id="outline-container-167-1" class="outline-4">
<h4 id="sec-167-1">Arguments </h4>
<div class="outline-text-4" id="text-167-1">

<p>(&amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-168" class="outline-3">
<h3 id="sec-168">PLASMA-RECT </h3>
<div class="outline-text-3" id="text-168">

</div>

</div>

<div id="outline-container-169" class="outline-3">
<h3 id="sec-169">PLAY </h3>
<div class="outline-text-3" id="text-169">


</div>

<div id="outline-container-169-1" class="outline-4">
<h4 id="sec-169-1">Arguments </h4>
<div class="outline-text-4" id="text-169-1">

<p>(&amp;OPTIONAL (MODULE-NAME standard))
</p></div>
</div>

</div>

<div id="outline-container-170" class="outline-3">
<h3 id="sec-170">PLAY-MUSIC </h3>
<div class="outline-text-3" id="text-170">


</div>

<div id="outline-container-170-1" class="outline-4">
<h4 id="sec-170-1">Arguments </h4>
<div class="outline-text-4" id="text-170-1">

<p>(MUSIC-NAME &amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-171" class="outline-3">
<h3 id="sec-171">PLAY-SAMPLE </h3>
<div class="outline-text-3" id="text-171">


</div>

<div id="outline-container-171-1" class="outline-4">
<h4 id="sec-171-1">Arguments </h4>
<div class="outline-text-4" id="text-171-1">

<p>(SAMPLE-NAME &amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-172" class="outline-3">
<h3 id="sec-172">POLL-JOYSTICK-AXIS </h3>
<div class="outline-text-3" id="text-172">


</div>

<div id="outline-container-172-1" class="outline-4">
<h4 id="sec-172-1">Arguments </h4>
<div class="outline-text-4" id="text-172-1">

<p>(AXIS)
</p></div>
</div>

</div>

<div id="outline-container-173" class="outline-3">
<h3 id="sec-173">QUEUE </h3>
<div class="outline-text-3" id="text-173">


</div>

<div id="outline-container-173-1" class="outline-4">
<h4 id="sec-173-1">Arguments </h4>
<div class="outline-text-4" id="text-173-1">

<p>(ITEM Q)
</p></div>
</div>

</div>

<div id="outline-container-174" class="outline-3">
<h3 id="sec-174">QUEUE-COUNT </h3>
<div class="outline-text-3" id="text-174">

</div>

</div>

<div id="outline-container-175" class="outline-3">
<h3 id="sec-175">QUEUE-HEAD </h3>
<div class="outline-text-3" id="text-175">

</div>

</div>

<div id="outline-container-176" class="outline-3">
<h3 id="sec-176">QUEUE-MAX </h3>
<div class="outline-text-3" id="text-176">

</div>

</div>

<div id="outline-container-177" class="outline-3">
<h3 id="sec-177">QUEUE-MESSAGE </h3>
<div class="outline-text-3" id="text-177">


</div>

<div id="outline-container-177-1" class="outline-4">
<h4 id="sec-177-1">Arguments </h4>
<div class="outline-text-4" id="text-177-1">

<p>(SENDER METHOD-KEY RECEIVER ARGS)
</p></div>

</div>

<div id="outline-container-177-2" class="outline-4">
<h4 id="sec-177-2">Documentation </h4>
<div class="outline-text-4" id="text-177-2">

<p>Enter a message into the current `*message-queue*'.
</p></div>
</div>

</div>

<div id="outline-container-178" class="outline-3">
<h3 id="sec-178">QUEUE-TAIL </h3>
<div class="outline-text-3" id="text-178">

</div>

</div>

<div id="outline-container-179" class="outline-3">
<h3 id="sec-179">QUEUED-MESSAGES-P </h3>
<div class="outline-text-3" id="text-179">


</div>

<div id="outline-container-179-1" class="outline-4">
<h4 id="sec-179-1">Documentation </h4>
<div class="outline-text-4" id="text-179-1">

<p>Return non-nil if there are queued messages.
</p></div>
</div>

</div>

<div id="outline-container-180" class="outline-3">
<h3 id="sec-180">QUIT </h3>
<div class="outline-text-3" id="text-180">


</div>

<div id="outline-container-180-1" class="outline-4">
<h4 id="sec-180-1">Arguments </h4>
<div class="outline-text-4" id="text-180-1">

<p>(&amp;OPTIONAL SHUTDOWN)
</p></div>
</div>

</div>

<div id="outline-container-181" class="outline-3">
<h3 id="sec-181">RANDOM-DIRECTION </h3>
<div class="outline-text-3" id="text-181">

</div>

</div>

<div id="outline-container-182" class="outline-3">
<h3 id="sec-182">READ-PAK </h3>
<div class="outline-text-3" id="text-182">


</div>

<div id="outline-container-182-1" class="outline-4">
<h4 id="sec-182-1">Arguments </h4>
<div class="outline-text-4" id="text-182-1">

<p>(FILENAME)
</p></div>

</div>

<div id="outline-container-182-2" class="outline-4">
<h4 id="sec-182-2">Documentation </h4>
<div class="outline-text-4" id="text-182-2">

<p>Return a list of resources from the PAK file FILENAME.
</p></div>
</div>

</div>

<div id="outline-container-183" class="outline-3">
<h3 id="sec-183">READ-SEXP-FROM-FILE </h3>
<div class="outline-text-3" id="text-183">


</div>

<div id="outline-container-183-1" class="outline-4">
<h4 id="sec-183-1">Arguments </h4>
<div class="outline-text-4" id="text-183-1">

<p>(FILENAME)
</p></div>
</div>

</div>

<div id="outline-container-184" class="outline-3">
<h3 id="sec-184">RENDER-FORMATTED-LINE </h3>
<div class="outline-text-3" id="text-184">


</div>

<div id="outline-container-184-1" class="outline-4">
<h4 id="sec-184-1">Arguments </h4>
<div class="outline-text-4" id="text-184-1">

<p>(LINE X Y &amp;KEY DESTINATION (FONT <b>DEFAULT-FONT</b>))
</p></div>

</div>

<div id="outline-container-184-2" class="outline-4">
<h4 id="sec-184-2">Documentation </h4>
<div class="outline-text-4" id="text-184-2">

<p>Render the formatted LINE at position X,Y on the image DESTINATION.
Return the height of the rendered line.
</p></div>
</div>

</div>
