notebook/rlx-doc.org
** RENDER-FORMATTED-PARAGRAPH
** RENDER-FORMATTED-STRING
*** Arguments
(FORMATTED-STRING X Y &KEY (TEXT-OFFSET 0) DESTINATION)
*** Documentation
Render the FORMATTED-STRING to position X,Y on the image DESTINATION.
If TEXT-OFFSET is provided, add that many pixels to the Y coordinate
for rendered text in the line. (This is used to make text align with
inline images that are larger than the text height---see also
`render-formatted-line').
** RENDER-PLASMA
*** Arguments
(HEIGHT WIDTH &KEY (GRAININESS 1.0) ARRAY)
** RESET
*** Arguments
(&OPTIONAL (MODULE-NAME standard))
** RESET-JOYSTICK
** RESOURCE
** RESOURCE-TO-PLIST
*** Arguments
(RES)
*** Documentation
Convert the resource record RES into a property list.

This prepares it for printing as part of a PAK file.
** RIGHT-HAND-SIDE
*** Arguments
(RULE)
** ROLL
*** Arguments
(ROLLS &OPTIONAL (SIDES 6) (ADDS 0))
*** Documentation
Total ROLLS rolls of a SIDES-sided die, then add ADDS.
So 2d6+2 would be (roll 2 6 2).
** ROLL-UNDER
*** Arguments
(N SIDES)
** RUN
** RUN-HOOK
*** Arguments
(HOOK)
*** Documentation
Call all the functions in HOOK, in list order.
** SEEK-MUSIC
** SELF
** SEND
*** Arguments
(SENDER METHOD OBJECT &REST ARGS)
*** Documentation
Invoke the method identified by the keyword METHOD on the OBJECT with ARGS.
If the method is not found, attempt to forward the message. The SENDER
argument is ignored for now.
** SEND-EVENT-TO-WIDGETS
*** Arguments
(EVENT)
*** Documentation
Attempt to deliver EVENT to each of the *active-widgets*
one at a time (in list order) until one of them is found to have a
matching keybinding, in which case the keybinding's corresponding
function is triggered. If none of the widgets have a matching
keybinding, nothing happens, and this function returns nil.
** SEND-QUEUE
*** Arguments
(SENDER METHOD-KEY OBJECT &REST ARGS)
*** Documentation
Queue a message. Returns nil.
** SEND-SUPER
** SET-BROWSER
** SET-FIELD-OPTION-VALUE
*** Arguments
(FIELD OBJECT OPTION VALUE)
*** Documentation
Set the value of the OPTION for FIELD in OBJECT to VALUE.
** SET-FIELD-OPTIONS
*** Arguments
(FIELD OBJECT OPTIONS)
*** Documentation
Set the options property list to OPTIONS for FIELD in OBJECT.
** SET-FIELD-VALUE
*** Arguments
(FIELD OBJECT VALUE)
*** Documentation
Set OBJECT's FIELD to VALUE.
The new value overrides any inherited value.
** SET-FRAME-RATE
*** Arguments
(RATE)
** SET-MESSAGE-VERBOSITIES
*** Arguments
(PLIST &OPTIONAL (INCLUDE-DEFAULT T))
** SET-MUSIC-VOLUME
*** Arguments
(NUMBER)
** SET-SCREEN-HEIGHT
*** Arguments
(HEIGHT)
** SET-SCREEN-WIDTH
*** Arguments
(WIDTH)
** SET-TIMER-INTERVAL
*** Arguments
(INTERVAL)
** SHOW-WIDGETS
*** Documentation
Draw the active widgets to the screen.
** SPLIT-STRING-ON-LINES
*** Arguments
(STRING)
** STAT-VALUE
** STEP-IN-DIRECTION
*** Arguments
(ROW COLUMN DIRECTION &OPTIONAL (N 1))
*** Documentation
Return the point ROW, COLUMN moved by n squares in DIRECTION.
** SUBDIVIDE-RECT
*** Arguments
(R)
*** Documentation
Subdivide rectangle R into four rectangles joined at the
center point of the original R, and return the list of four
rectangles, or NIL if they would be smaller than one pixel.
** TRACE-COLUMN
