notebook/rlx-doc.html

<div id="outline-container-185" class="outline-3">
<h3 id="sec-185">RENDER-FORMATTED-PARAGRAPH </h3>
<div class="outline-text-3" id="text-185">

</div>

</div>

<div id="outline-container-186" class="outline-3">
<h3 id="sec-186">RENDER-FORMATTED-STRING </h3>
<div class="outline-text-3" id="text-186">


</div>

<div id="outline-container-186-1" class="outline-4">
<h4 id="sec-186-1">Arguments </h4>
<div class="outline-text-4" id="text-186-1">

<p>(FORMATTED-STRING X Y &amp;KEY (TEXT-OFFSET 0) DESTINATION)
</p></div>

</div>

<div id="outline-container-186-2" class="outline-4">
<h4 id="sec-186-2">Documentation </h4>
<div class="outline-text-4" id="text-186-2">

<p>Render the FORMATTED-STRING to position X,Y on the image DESTINATION.
If TEXT-OFFSET is provided, add that many pixels to the Y coordinate
for rendered text in the line. (This is used to make text align with
inline images that are larger than the text height&mdash;see also
`render-formatted-line').
</p></div>
</div>

</div>

<div id="outline-container-187" class="outline-3">
<h3 id="sec-187">RENDER-PLASMA </h3>
<div class="outline-text-3" id="text-187">


</div>

<div id="outline-container-187-1" class="outline-4">
<h4 id="sec-187-1">Arguments </h4>
<div class="outline-text-4" id="text-187-1">

<p>(HEIGHT WIDTH &amp;KEY (GRAININESS 1.0) ARRAY)
</p></div>
</div>

</div>

<div id="outline-container-188" class="outline-3">
<h3 id="sec-188">RESET </h3>
<div class="outline-text-3" id="text-188">


</div>

<div id="outline-container-188-1" class="outline-4">
<h4 id="sec-188-1">Arguments </h4>
<div class="outline-text-4" id="text-188-1">

<p>(&amp;OPTIONAL (MODULE-NAME standard))
</p></div>
</div>

</div>

<div id="outline-container-189" class="outline-3">
<h3 id="sec-189">RESET-JOYSTICK </h3>
<div class="outline-text-3" id="text-189">

</div>

</div>

<div id="outline-container-190" class="outline-3">
<h3 id="sec-190">RESOURCE </h3>
<div class="outline-text-3" id="text-190">

</div>

</div>

<div id="outline-container-191" class="outline-3">
<h3 id="sec-191">RESOURCE-TO-PLIST </h3>
<div class="outline-text-3" id="text-191">


</div>

<div id="outline-container-191-1" class="outline-4">
<h4 id="sec-191-1">Arguments </h4>
<div class="outline-text-4" id="text-191-1">

<p>(RES)
</p></div>

</div>

<div id="outline-container-191-2" class="outline-4">
<h4 id="sec-191-2">Documentation </h4>
<div class="outline-text-4" id="text-191-2">

<p>Convert the resource record RES into a property list.
</p>
<p>
This prepares it for printing as part of a PAK file.
</p></div>
</div>

</div>

<div id="outline-container-192" class="outline-3">
<h3 id="sec-192">RIGHT-HAND-SIDE </h3>
<div class="outline-text-3" id="text-192">


</div>

<div id="outline-container-192-1" class="outline-4">
<h4 id="sec-192-1">Arguments </h4>
<div class="outline-text-4" id="text-192-1">

<p>(RULE)
</p></div>
</div>

</div>

<div id="outline-container-193" class="outline-3">
<h3 id="sec-193">ROLL </h3>
<div class="outline-text-3" id="text-193">


</div>

<div id="outline-container-193-1" class="outline-4">
<h4 id="sec-193-1">Arguments </h4>
<div class="outline-text-4" id="text-193-1">

<p>(ROLLS &amp;OPTIONAL (SIDES 6) (ADDS 0))
</p></div>

</div>

<div id="outline-container-193-2" class="outline-4">
<h4 id="sec-193-2">Documentation </h4>
<div class="outline-text-4" id="text-193-2">

<p>Total ROLLS rolls of a SIDES-sided die, then add ADDS.
So 2d6+2 would be (roll 2 6 2).
</p></div>
</div>

</div>

<div id="outline-container-194" class="outline-3">
<h3 id="sec-194">ROLL-UNDER </h3>
<div class="outline-text-3" id="text-194">


</div>

<div id="outline-container-194-1" class="outline-4">
<h4 id="sec-194-1">Arguments </h4>
<div class="outline-text-4" id="text-194-1">

<p>(N SIDES)
</p></div>
</div>

</div>

<div id="outline-container-195" class="outline-3">
<h3 id="sec-195">RUN </h3>
<div class="outline-text-3" id="text-195">

</div>

</div>

<div id="outline-container-196" class="outline-3">
<h3 id="sec-196">RUN-HOOK </h3>
<div class="outline-text-3" id="text-196">


</div>

<div id="outline-container-196-1" class="outline-4">
<h4 id="sec-196-1">Arguments </h4>
<div class="outline-text-4" id="text-196-1">

<p>(HOOK)
</p></div>

</div>

<div id="outline-container-196-2" class="outline-4">
<h4 id="sec-196-2">Documentation </h4>
<div class="outline-text-4" id="text-196-2">

<p>Call all the functions in HOOK, in list order.
</p></div>
</div>

</div>

<div id="outline-container-197" class="outline-3">
<h3 id="sec-197">SEEK-MUSIC </h3>
<div class="outline-text-3" id="text-197">

</div>

</div>

<div id="outline-container-198" class="outline-3">
<h3 id="sec-198">SELF </h3>
<div class="outline-text-3" id="text-198">

</div>

</div>

<div id="outline-container-199" class="outline-3">
<h3 id="sec-199">SEND </h3>
<div class="outline-text-3" id="text-199">


</div>

<div id="outline-container-199-1" class="outline-4">
<h4 id="sec-199-1">Arguments </h4>
<div class="outline-text-4" id="text-199-1">

<p>(SENDER METHOD OBJECT &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-199-2" class="outline-4">
<h4 id="sec-199-2">Documentation </h4>
<div class="outline-text-4" id="text-199-2">

<p>Invoke the method identified by the keyword METHOD on the OBJECT with ARGS.
If the method is not found, attempt to forward the message. The SENDER
argument is ignored for now.
</p></div>
</div>

</div>

<div id="outline-container-200" class="outline-3">
<h3 id="sec-200">SEND-EVENT-TO-WIDGETS </h3>
<div class="outline-text-3" id="text-200">


</div>

<div id="outline-container-200-1" class="outline-4">
<h4 id="sec-200-1">Arguments </h4>
<div class="outline-text-4" id="text-200-1">

<p>(EVENT)
</p></div>

</div>

<div id="outline-container-200-2" class="outline-4">
<h4 id="sec-200-2">Documentation </h4>
<div class="outline-text-4" id="text-200-2">

<p>Attempt to deliver EVENT to each of the <b>active-widgets</b>
one at a time (in list order) until one of them is found to have a
matching keybinding, in which case the keybinding's corresponding
function is triggered. If none of the widgets have a matching
keybinding, nothing happens, and this function returns nil.
</p></div>
</div>

</div>

<div id="outline-container-201" class="outline-3">
<h3 id="sec-201">SEND-QUEUE </h3>
<div class="outline-text-3" id="text-201">


</div>

<div id="outline-container-201-1" class="outline-4">
<h4 id="sec-201-1">Arguments </h4>
<div class="outline-text-4" id="text-201-1">

<p>(SENDER METHOD-KEY OBJECT &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-201-2" class="outline-4">
<h4 id="sec-201-2">Documentation </h4>
<div class="outline-text-4" id="text-201-2">

<p>Queue a message. Returns nil.
</p></div>
</div>

</div>

<div id="outline-container-202" class="outline-3">
<h3 id="sec-202">SEND-SUPER </h3>
<div class="outline-text-3" id="text-202">

</div>

</div>

<div id="outline-container-203" class="outline-3">
<h3 id="sec-203">SET-BROWSER </h3>
<div class="outline-text-3" id="text-203">

</div>

</div>

<div id="outline-container-204" class="outline-3">
<h3 id="sec-204">SET-FIELD-OPTION-VALUE </h3>
<div class="outline-text-3" id="text-204">


</div>

<div id="outline-container-204-1" class="outline-4">
<h4 id="sec-204-1">Arguments </h4>
<div class="outline-text-4" id="text-204-1">

<p>(FIELD OBJECT OPTION VALUE)
</p></div>

</div>

<div id="outline-container-204-2" class="outline-4">
<h4 id="sec-204-2">Documentation </h4>
<div class="outline-text-4" id="text-204-2">

<p>Set the value of the OPTION for FIELD in OBJECT to VALUE.
</p></div>
</div>

</div>

<div id="outline-container-205" class="outline-3">
<h3 id="sec-205">SET-FIELD-OPTIONS </h3>
<div class="outline-text-3" id="text-205">


</div>

<div id="outline-container-205-1" class="outline-4">
<h4 id="sec-205-1">Arguments </h4>
<div class="outline-text-4" id="text-205-1">

<p>(FIELD OBJECT OPTIONS)
</p></div>

</div>

<div id="outline-container-205-2" class="outline-4">
<h4 id="sec-205-2">Documentation </h4>
<div class="outline-text-4" id="text-205-2">

<p>Set the options property list to OPTIONS for FIELD in OBJECT.
</p></div>
</div>

</div>

<div id="outline-container-206" class="outline-3">
<h3 id="sec-206">SET-FIELD-VALUE </h3>
<div class="outline-text-3" id="text-206">


</div>

<div id="outline-container-206-1" class="outline-4">
<h4 id="sec-206-1">Arguments </h4>
<div class="outline-text-4" id="text-206-1">

<p>(FIELD OBJECT VALUE)
</p></div>

</div>

<div id="outline-container-206-2" class="outline-4">
<h4 id="sec-206-2">Documentation </h4>
<div class="outline-text-4" id="text-206-2">

<p>Set OBJECT's FIELD to VALUE.
The new value overrides any inherited value.
</p></div>
</div>

</div>

<div id="outline-container-207" class="outline-3">
<h3 id="sec-207">SET-FRAME-RATE </h3>
<div class="outline-text-3" id="text-207">


</div>

<div id="outline-container-207-1" class="outline-4">
<h4 id="sec-207-1">Arguments </h4>
<div class="outline-text-4" id="text-207-1">

<p>(RATE)
</p></div>
</div>

</div>

<div id="outline-container-208" class="outline-3">
<h3 id="sec-208">SET-MESSAGE-VERBOSITIES </h3>
<div class="outline-text-3" id="text-208">


</div>

<div id="outline-container-208-1" class="outline-4">
<h4 id="sec-208-1">Arguments </h4>
<div class="outline-text-4" id="text-208-1">

<p>(PLIST &amp;OPTIONAL (INCLUDE-DEFAULT T))
</p></div>
</div>

</div>

<div id="outline-container-209" class="outline-3">
<h3 id="sec-209">SET-MUSIC-VOLUME </h3>
<div class="outline-text-3" id="text-209">


</div>

<div id="outline-container-209-1" class="outline-4">
<h4 id="sec-209-1">Arguments </h4>
<div class="outline-text-4" id="text-209-1">

<p>(NUMBER)
</p></div>
</div>

</div>

<div id="outline-container-210" class="outline-3">
<h3 id="sec-210">SET-SCREEN-HEIGHT </h3>
<div class="outline-text-3" id="text-210">


</div>

<div id="outline-container-210-1" class="outline-4">
<h4 id="sec-210-1">Arguments </h4>
<div class="outline-text-4" id="text-210-1">

<p>(HEIGHT)
</p></div>
</div>

</div>

<div id="outline-container-211" class="outline-3">
<h3 id="sec-211">SET-SCREEN-WIDTH </h3>
<div class="outline-text-3" id="text-211">


</div>

<div id="outline-container-211-1" class="outline-4">
<h4 id="sec-211-1">Arguments </h4>
<div class="outline-text-4" id="text-211-1">

<p>(WIDTH)
</p></div>
</div>

</div>

<div id="outline-container-212" class="outline-3">
<h3 id="sec-212">SET-TIMER-INTERVAL </h3>
<div class="outline-text-3" id="text-212">


</div>

<div id="outline-container-212-1" class="outline-4">
<h4 id="sec-212-1">Arguments </h4>
<div class="outline-text-4" id="text-212-1">

<p>(INTERVAL)
</p></div>
</div>

</div>

<div id="outline-container-213" class="outline-3">
<h3 id="sec-213">SHOW-WIDGETS </h3>
<div class="outline-text-3" id="text-213">


</div>

<div id="outline-container-213-1" class="outline-4">
<h4 id="sec-213-1">Documentation </h4>
<div class="outline-text-4" id="text-213-1">

<p>Draw the active widgets to the screen.
</p></div>
</div>

</div>

<div id="outline-container-214" class="outline-3">
<h3 id="sec-214">SPLIT-STRING-ON-LINES </h3>
<div class="outline-text-3" id="text-214">


</div>

<div id="outline-container-214-1" class="outline-4">
<h4 id="sec-214-1">Arguments </h4>
<div class="outline-text-4" id="text-214-1">

<p>(STRING)
</p></div>
</div>

</div>

<div id="outline-container-215" class="outline-3">
<h3 id="sec-215">STAT-VALUE </h3>
<div class="outline-text-3" id="text-215">

</div>

</div>

<div id="outline-container-216" class="outline-3">
<h3 id="sec-216">STEP-IN-DIRECTION </h3>
<div class="outline-text-3" id="text-216">


</div>

<div id="outline-container-216-1" class="outline-4">
<h4 id="sec-216-1">Arguments </h4>
<div class="outline-text-4" id="text-216-1">

<p>(ROW COLUMN DIRECTION &amp;OPTIONAL (N 1))
</p></div>

</div>

<div id="outline-container-216-2" class="outline-4">
<h4 id="sec-216-2">Documentation </h4>
<div class="outline-text-4" id="text-216-2">

<p>Return the point ROW, COLUMN moved by n squares in DIRECTION.
</p></div>
</div>

</div>

<div id="outline-container-217" class="outline-3">
<h3 id="sec-217">SUBDIVIDE-RECT </h3>
<div class="outline-text-3" id="text-217">


</div>

<div id="outline-container-217-1" class="outline-4">
<h4 id="sec-217-1">Arguments </h4>
<div class="outline-text-4" id="text-217-1">

<p>(R)
</p></div>

</div>

<div id="outline-container-217-2" class="outline-4">
<h4 id="sec-217-2">Documentation </h4>
<div class="outline-text-4" id="text-217-2">

<p>Subdivide rectangle R into four rectangles joined at the
center point of the original R, and return the list of four
rectangles, or NIL if they would be smaller than one pixel.
</p></div>
</div>

</div>
