notebook/rlx-doc.org
*** Arguments
(TRACE-FUNCTION COLUMN Y0 Y1)
** TRACE-LINE
*** Arguments
(TRACE-FUNCTION X0 Y0 X1 Y1)
*** Documentation
Trace a line between X0,Y0 and X1,Y1.
calling TRACE-FUNCTION at each point of the line.
** TRACE-OCTAGON
*** Arguments
(TRACE-FUNCTION CENTER-ROW CENTER-COLUMN RADIUS &OPTIONAL THICKEN)
*** Documentation
Call TRACE-FUNCTION for each point on the octagon of radius RADIUS
centered at row ROW, column COLUMN. When THICKEN is non-nil, thicken
the diagonals of the rectangle in order to facilitate raycasting.
It's an ugly hack, but it helps reduce artifacts.
** TRACE-RECTANGLE
*** Arguments
(TRACE-FUNCTION ROW COLUMN HEIGHT WIDTH &OPTIONAL FILL)
*** Documentation
Call TRACE-FUNCTION for each point on the rectangle of HEIGHT and
WIDTH with top left corner at ROW COLUMN. When FILL is non-nil, fill
the rectangle.
** TRACE-ROW
*** Arguments
(TRACE-FUNCTION ROW X0 X1)
** TRANSFORM-DECLARATION-FIELD-DESCRIPTOR
*** Arguments
(D)
*** Documentation
Convert the declaration-field-descriptor D into a canonical field
descriptor.

The descriptor D must be either a symbol, in which case a field is
defined with no options, or a list of the form:

 (:FIELD-NAME . OPTIONS)

Where OPTIONS is a property list of field options.

The returned entry will be of the form:

 (:FIELD-NAME OPTIONS) 

and will be suitable for use with the functions that operate on field
descriptors, and for inclusion in the association list
<field-descriptors>.

See also `define-prototype'.
** TRANSFORM-FIELD-REFERENCE
*** Arguments
(REF)
*** Documentation
Change the symbol REF from <foo> to (field-value :foo self).
** TRANSFORM-METHOD-BODY
*** Arguments
(BODY)
*** Documentation
Process the forms in BODY to transform field references.
** TRANSFORM-TREE
*** Arguments
(TESTER TRANSFORMER TREE)
** UNQUEUE
*** Arguments
(Q)
** UNQUEUE-MESSAGE
*** Documentation
Remove the next message from the queue. The returned message is a
list of the form (METHOD-KEY RECEIVER ARGS).
** WHILE
*** Arguments
(&REST ARGS)
** WITH-MESSAGE-QUEUE
*** Arguments
(&REST ARGS)
*** Documentation
Run the BODY forms, capturing any queued output messages to the
message queue resulting from the evaluation of EXPR.
** WITH-MESSAGE-SENDER
** WORLD
** WRITE-PAK
*** Arguments
(FILENAME RESOURCES)
*** Documentation
Write the RESOURCES to the PAK file FILENAME.
** WRITE-SEXP-TO-FILE
*** Arguments
(FILENAME SEXP)
** ZOOM-IMAGE
*** Arguments
(IMAGE FACTOR)
