notebook/rlx-doc.html

<div id="outline-container-218" class="outline-3">
<h3 id="sec-218">TRACE-COLUMN </h3>
<div class="outline-text-3" id="text-218">


</div>

<div id="outline-container-218-1" class="outline-4">
<h4 id="sec-218-1">Arguments </h4>
<div class="outline-text-4" id="text-218-1">

<p>(TRACE-FUNCTION COLUMN Y0 Y1)
</p></div>
</div>

</div>

<div id="outline-container-219" class="outline-3">
<h3 id="sec-219">TRACE-LINE </h3>
<div class="outline-text-3" id="text-219">


</div>

<div id="outline-container-219-1" class="outline-4">
<h4 id="sec-219-1">Arguments </h4>
<div class="outline-text-4" id="text-219-1">

<p>(TRACE-FUNCTION X0 Y0 X1 Y1)
</p></div>

</div>

<div id="outline-container-219-2" class="outline-4">
<h4 id="sec-219-2">Documentation </h4>
<div class="outline-text-4" id="text-219-2">

<p>Trace a line between X0,Y0 and X1,Y1.
calling TRACE-FUNCTION at each point of the line.
</p></div>
</div>

</div>

<div id="outline-container-220" class="outline-3">
<h3 id="sec-220">TRACE-OCTAGON </h3>
<div class="outline-text-3" id="text-220">


</div>

<div id="outline-container-220-1" class="outline-4">
<h4 id="sec-220-1">Arguments </h4>
<div class="outline-text-4" id="text-220-1">

<p>(TRACE-FUNCTION CENTER-ROW CENTER-COLUMN RADIUS &amp;OPTIONAL THICKEN)
</p></div>

</div>

<div id="outline-container-220-2" class="outline-4">
<h4 id="sec-220-2">Documentation </h4>
<div class="outline-text-4" id="text-220-2">

<p>Call TRACE-FUNCTION for each point on the octagon of radius RADIUS
centered at row ROW, column COLUMN. When THICKEN is non-nil, thicken
the diagonals of the rectangle in order to facilitate raycasting.
It's an ugly hack, but it helps reduce artifacts.
</p></div>
</div>

</div>

<div id="outline-container-221" class="outline-3">
<h3 id="sec-221">TRACE-RECTANGLE </h3>
<div class="outline-text-3" id="text-221">


</div>

<div id="outline-container-221-1" class="outline-4">
<h4 id="sec-221-1">Arguments </h4>
<div class="outline-text-4" id="text-221-1">

<p>(TRACE-FUNCTION ROW COLUMN HEIGHT WIDTH &amp;OPTIONAL FILL)
</p></div>

</div>

<div id="outline-container-221-2" class="outline-4">
<h4 id="sec-221-2">Documentation </h4>
<div class="outline-text-4" id="text-221-2">

<p>Call TRACE-FUNCTION for each point on the rectangle of HEIGHT and
WIDTH with top left corner at ROW COLUMN. When FILL is non-nil, fill
the rectangle.
</p></div>
</div>

</div>

<div id="outline-container-222" class="outline-3">
<h3 id="sec-222">TRACE-ROW </h3>
<div class="outline-text-3" id="text-222">


</div>

<div id="outline-container-222-1" class="outline-4">
<h4 id="sec-222-1">Arguments </h4>
<div class="outline-text-4" id="text-222-1">

<p>(TRACE-FUNCTION ROW X0 X1)
</p></div>
</div>

</div>

<div id="outline-container-223" class="outline-3">
<h3 id="sec-223">TRANSFORM-DECLARATION-FIELD-DESCRIPTOR </h3>
<div class="outline-text-3" id="text-223">


</div>

<div id="outline-container-223-1" class="outline-4">
<h4 id="sec-223-1">Arguments </h4>
<div class="outline-text-4" id="text-223-1">

<p>(D)
</p></div>

</div>

<div id="outline-container-223-2" class="outline-4">
<h4 id="sec-223-2">Documentation </h4>
<div class="outline-text-4" id="text-223-2">

<p>Convert the declaration-field-descriptor D into a canonical field
descriptor.
</p>
<p>
The descriptor D must be either a symbol, in which case a field is
defined with no options, or a list of the form:
</p>
<p>
 (:FIELD-NAME . OPTIONS)
</p>
<p>
Where OPTIONS is a property list of field options.
</p>
<p>
The returned entry will be of the form:
</p>
<p>
 (:FIELD-NAME OPTIONS) 
</p>
<p>
and will be suitable for use with the functions that operate on field
descriptors, and for inclusion in the association list
&lt;field-descriptors&gt;.
</p>
<p>
See also `define-prototype'.
</p></div>
</div>

</div>

<div id="outline-container-224" class="outline-3">
<h3 id="sec-224">TRANSFORM-FIELD-REFERENCE </h3>
<div class="outline-text-3" id="text-224">


</div>

<div id="outline-container-224-1" class="outline-4">
<h4 id="sec-224-1">Arguments </h4>
<div class="outline-text-4" id="text-224-1">

<p>(REF)
</p></div>

</div>

<div id="outline-container-224-2" class="outline-4">
<h4 id="sec-224-2">Documentation </h4>
<div class="outline-text-4" id="text-224-2">

<p>Change the symbol REF from &lt;foo&gt; to (field-value :foo self).
</p></div>
</div>

</div>

<div id="outline-container-225" class="outline-3">
<h3 id="sec-225">TRANSFORM-METHOD-BODY </h3>
<div class="outline-text-3" id="text-225">


</div>

<div id="outline-container-225-1" class="outline-4">
<h4 id="sec-225-1">Arguments </h4>
<div class="outline-text-4" id="text-225-1">

<p>(BODY)
</p></div>

</div>

<div id="outline-container-225-2" class="outline-4">
<h4 id="sec-225-2">Documentation </h4>
<div class="outline-text-4" id="text-225-2">

<p>Process the forms in BODY to transform field references.
</p></div>
</div>

</div>

<div id="outline-container-226" class="outline-3">
<h3 id="sec-226">TRANSFORM-TREE </h3>
<div class="outline-text-3" id="text-226">


</div>

<div id="outline-container-226-1" class="outline-4">
<h4 id="sec-226-1">Arguments </h4>
<div class="outline-text-4" id="text-226-1">

<p>(TESTER TRANSFORMER TREE)
</p></div>
</div>

</div>

<div id="outline-container-227" class="outline-3">
<h3 id="sec-227">UNQUEUE </h3>
<div class="outline-text-3" id="text-227">


</div>

<div id="outline-container-227-1" class="outline-4">
<h4 id="sec-227-1">Arguments </h4>
<div class="outline-text-4" id="text-227-1">

<p>(Q)
</p></div>
</div>

</div>

<div id="outline-container-228" class="outline-3">
<h3 id="sec-228">UNQUEUE-MESSAGE </h3>
<div class="outline-text-3" id="text-228">


</div>

<div id="outline-container-228-1" class="outline-4">
<h4 id="sec-228-1">Documentation </h4>
<div class="outline-text-4" id="text-228-1">

<p>Remove the next message from the queue. The returned message is a
list of the form (METHOD-KEY RECEIVER ARGS).
</p></div>
</div>

</div>

<div id="outline-container-229" class="outline-3">
<h3 id="sec-229">WHILE </h3>
<div class="outline-text-3" id="text-229">


</div>

<div id="outline-container-229-1" class="outline-4">
<h4 id="sec-229-1">Arguments </h4>
<div class="outline-text-4" id="text-229-1">

<p>(&amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-230" class="outline-3">
<h3 id="sec-230">WITH-MESSAGE-QUEUE </h3>
<div class="outline-text-3" id="text-230">


</div>

<div id="outline-container-230-1" class="outline-4">
<h4 id="sec-230-1">Arguments </h4>
<div class="outline-text-4" id="text-230-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-230-2" class="outline-4">
<h4 id="sec-230-2">Documentation </h4>
<div class="outline-text-4" id="text-230-2">

<p>Run the BODY forms, capturing any queued output messages to the
message queue resulting from the evaluation of EXPR.
</p></div>
</div>

</div>

<div id="outline-container-231" class="outline-3">
<h3 id="sec-231">WITH-MESSAGE-SENDER </h3>
<div class="outline-text-3" id="text-231">

</div>

</div>

<div id="outline-container-232" class="outline-3">
<h3 id="sec-232">WORLD </h3>
<div class="outline-text-3" id="text-232">

</div>

</div>

<div id="outline-container-233" class="outline-3">
<h3 id="sec-233">WRITE-PAK </h3>
<div class="outline-text-3" id="text-233">


</div>

<div id="outline-container-233-1" class="outline-4">
<h4 id="sec-233-1">Arguments </h4>
<div class="outline-text-4" id="text-233-1">

<p>(FILENAME RESOURCES)
</p></div>

</div>

<div id="outline-container-233-2" class="outline-4">
<h4 id="sec-233-2">Documentation </h4>
<div class="outline-text-4" id="text-233-2">

<p>Write the RESOURCES to the PAK file FILENAME.
</p></div>
</div>

</div>

<div id="outline-container-234" class="outline-3">
<h3 id="sec-234">WRITE-SEXP-TO-FILE </h3>
<div class="outline-text-3" id="text-234">


</div>

<div id="outline-container-234-1" class="outline-4">
<h4 id="sec-234-1">Arguments </h4>
<div class="outline-text-4" id="text-234-1">

<p>(FILENAME SEXP)
</p></div>
</div>

</div>

<div id="outline-container-235" class="outline-3">
<h3 id="sec-235">ZOOM-IMAGE </h3>
<div class="outline-text-3" id="text-235">


</div>

<div id="outline-container-235-1" class="outline-4">
<h4 id="sec-235-1">Arguments </h4>
<div class="outline-text-4" id="text-235-1">

<p>(IMAGE FACTOR)
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-08-02 18:58:41 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
